{
  "version": "1.1.9",
  "lastUpdated": "2026-01-23",
  "changes": [
    {
      "version": "1.1.9",
      "date": "2026-01-23",
      "type": "fix",
      "title": {
        "en": "Fix deployment health check timeout",
        "fr": "Correction du délai d'expiration de la vérification de santé du déploiement",
        "es": "Corregir tiempo de espera de verificación de salud de implementación"
      },
      "description": {
        "en": "Increased health check timeout to 120 seconds to prevent deployment failures during service wake-up",
        "fr": "Augmentation du délai d'expiration de la vérification de santé à 120 secondes pour éviter les échecs de déploiement pendant le réveil du service",
        "es": "Aumentado el tiempo de espera de verificación de salud a 120 segundos para evitar fallos de implementación durante el inicio del servicio"
      }
    },
    {
      "version": "1.1.8",
      "date": "2026-01-23",
      "type": "feature",
      "title": {
        "en": "Custom Domain Migration",
        "es": "Migración de Dominio Personalizado",
        "fr": "Migration de Domaine Personnalisé",
        "de": "Benutzerdefinierte Domain-Migration",
        "it": "Migrazione Dominio Personalizzato",
        "pt": "Migração de Domínio Personalizado",
        "pl": "Migracja Domeny Niestandardowej"
      },
      "description": {
        "en": "Migrated application to new custom domain evoucher.bakupservices.co.uk. All traffic from old domains (app.breezeconsult.org and Render domains) automatically redirects to the new domain with SSL certificate.",
        "es": "Se migró la aplicación al nuevo dominio personalizado evoucher.bakupservices.co.uk. Todo el tráfico de los dominios antiguos (app.breezeconsult.org y dominios Render) se redirige automáticamente al nuevo dominio con certificado SSL.",
        "fr": "Migration de l'application vers le nouveau domaine personnalisé evoucher.bakupservices.co.uk. Tout le trafic des anciens domaines (app.breezeconsult.org et domaines Render) est automatiquement redirigé vers le nouveau domaine avec certificat SSL.",
        "de": "Anwendung auf neue benutzerdefinierte Domain evoucher.bakupservices.co.uk migriert. Aller Verkehr von alten Domains (app.breezeconsult.org und Render-Domains) wird automatisch zur neuen Domain mit SSL-Zertifikat umgeleitet.",
        "it": "Migrata l'applicazione al nuovo dominio personalizzato evoucher.bakupservices.co.uk. Tutto il traffico dai vecchi domini (app.breezeconsult.org e domini Render) viene automaticamente reindirizzato al nuovo dominio con certificato SSL.",
        "pt": "Migrou o aplicativo para o novo domínio personalizado evoucher.bakupservices.co.uk. Todo o tráfego dos domínios antigos (app.breezeconsult.org e domínios Render) é automaticamente redirecionado para o novo domínio com certificado SSL.",
        "pl": "Migracja aplikacji do nowej domeny niestandardowej evoucher.bakupservices.co.uk. Cały ruch ze starych domen (app.breezeconsult.org i domen Render) jest automatycznie przekierowywany do nowej domeny z certyfikatem SSL."
      }
    },
    {
      "version": "1.1.7",
      "date": "2026-01-23",
      "type": "fix",
      "title": {
        "en": "Fixed Deployment Build Path Issue",
        "es": "Corregido Problema de Ruta de Compilación",
        "fr": "Correction du Problème de Chemin de Build",
        "de": "Build-Pfad-Problem behoben",
        "it": "Risolto Problema Percorso Build",
        "pt": "Corrigido Problema de Caminho de Build",
        "pl": "Naprawiono Problem Ścieżki Budowania"
      },
      "description": {
        "en": "Fixed deployment failure caused by strict frontend build verification. The server now starts successfully even if build directory verification encounters issues, allowing the application to deploy correctly on Render.",
        "es": "Se corrigió el fallo de despliegue causado por la verificación estricta de compilación del frontend. El servidor ahora se inicia correctamente incluso si la verificación del directorio de compilación encuentra problemas, permitiendo que la aplicación se despliegue correctamente en Render.",
        "fr": "Correction de l'échec du déploiement causé par la vérification stricte du build frontend. Le serveur démarre maintenant avec succès même si la vérification du répertoire de build rencontre des problèmes, permettant à l'application de se déployer correctement sur Render.",
        "de": "Bereitstellungsfehler behoben, der durch strikte Frontend-Build-Überprüfung verursacht wurde. Der Server startet jetzt erfolgreich, auch wenn die Build-Verzeichnis-Überprüfung auf Probleme stößt, sodass die Anwendung korrekt auf Render bereitgestellt werden kann.",
        "it": "Risolto il fallimento della distribuzione causato dalla verifica rigorosa del build frontend. Il server ora si avvia correttamente anche se la verifica della directory di build incontra problemi, consentendo all'applicazione di distribuirsi correttamente su Render.",
        "pt": "Corrigido falha de implantação causada pela verificação rigorosa do build frontend. O servidor agora inicia com sucesso mesmo se a verificação do diretório de build encontrar problemas, permitindo que o aplicativo seja implantado corretamente no Render.",
        "pl": "Naprawiono błąd wdrożenia spowodowany ścisłą weryfikacją budowania frontendu. Serwer teraz uruchamia się pomyślnie, nawet jeśli weryfikacja katalogu budowania napotka problemy, umożliwiając prawidłowe wdrożenie aplikacji na Render."
      }
    },
    {
      "version": "1.1.6",
      "date": "2026-01-23",
      "type": "improvement",
      "title": {
        "en": "Removed Twilio SMS Dependency",
        "es": "Eliminada Dependencia SMS de Twilio",
        "fr": "Suppression de la Dépendance SMS Twilio",
        "de": "Twilio SMS-Abhängigkeit entfernt",
        "it": "Rimossa Dipendenza SMS Twilio",
        "pt": "Removida Dependência SMS Twilio",
        "pl": "Usunięto Zależność SMS Twilio"
      },
      "description": {
        "en": "Completely removed Twilio SMS service to reduce costs and simplify deployment. SMS notifications are now disabled. Email notifications via Gmail remain fully functional. This change eliminates deployment warnings and reduces infrastructure complexity.",
        "es": "Se eliminó completamente el servicio SMS de Twilio para reducir costos y simplificar el despliegue. Las notificaciones por SMS ahora están deshabilitadas. Las notificaciones por correo electrónico a través de Gmail siguen siendo completamente funcionales. Este cambio elimina las advertencias de despliegue y reduce la complejidad de la infraestructura.",
        "fr": "Suppression complète du service SMS Twilio pour réduire les coûts et simplifier le déploiement. Les notifications SMS sont désormais désactivées. Les notifications par e-mail via Gmail restent entièrement fonctionnelles. Ce changement élimine les avertissements de déploiement et réduit la complexité de l'infrastructure.",
        "de": "Twilio SMS-Service vollständig entfernt, um Kosten zu senken und die Bereitstellung zu vereinfachen. SMS-Benachrichtigungen sind jetzt deaktiviert. E-Mail-Benachrichtigungen über Gmail bleiben voll funktionsfähig. Diese Änderung beseitigt Bereitstellungswarnungen und reduziert die Infrastrukturkomplexität.",
        "it": "Rimosso completamente il servizio SMS Twilio per ridurre i costi e semplificare la distribuzione. Le notifiche SMS sono ora disabilitate. Le notifiche email tramite Gmail rimangono completamente funzionali. Questa modifica elimina gli avvisi di distribuzione e riduce la complessità dell'infrastruttura.",
        "pt": "Removido completamente o serviço SMS Twilio para reduzir custos e simplificar a implantação. As notificações por SMS agora estão desabilitadas. As notificações por email via Gmail permanecem totalmente funcionais. Esta alteração elimina avisos de implantação e reduz a complexidade da infraestrutura.",
        "pl": "Całkowicie usunięto usługę SMS Twilio, aby obniżyć koszty i uprościć wdrożenie. Powiadomienia SMS są teraz wyłączone. Powiadomienia e-mail przez Gmail pozostają w pełni funkcjonalne. Ta zmiana eliminuje ostrzeżenia wdrożeniowe i zmniejsza złożoność infrastruktury."
      }
    },
    {
      "version": "1.1.5",
      "date": "2026-01-23",
      "type": "fix",
      "title": {
        "en": "Fixed Deployment and Email Service",
        "es": "Corrección de Despliegue y Servicio de Correo",
        "fr": "Correction du Déploiement et du Service de Messagerie",
        "de": "Bereitstellung und E-Mail-Service behoben",
        "it": "Correzione Distribuzione e Servizio Email",
        "pt": "Correção de Implantação e Serviço de Email",
        "pl": "Naprawiono Wdrożenie i Usługę Email"
      },
      "description": {
        "en": "Switched from SendGrid to Gmail SMTP for email notifications (free tier, 500 emails/day). Fixed frontend build path error that prevented deployment. Email service now uses Gmail App Password for reliable delivery.",
        "es": "Cambio de SendGrid a Gmail SMTP para notificaciones por correo (nivel gratuito, 500 correos/día). Se corrigió el error de ruta de compilación del frontend que impedía el despliegue. El servicio de correo ahora usa contraseña de aplicación de Gmail para entrega confiable.",
        "fr": "Passage de SendGrid à Gmail SMTP pour les notifications par e-mail (niveau gratuit, 500 e-mails/jour). Correction de l'erreur de chemin de compilation frontend qui empêchait le déploiement. Le service de messagerie utilise désormais le mot de passe d'application Gmail pour une livraison fiable.",
        "de": "Wechsel von SendGrid zu Gmail SMTP für E-Mail-Benachrichtigungen (kostenlose Stufe, 500 E-Mails/Tag). Frontend-Build-Pfadfehler behoben, der die Bereitstellung verhinderte. E-Mail-Service verwendet jetzt Gmail-App-Passwort für zuverlässige Zustellung.",
        "it": "Passaggio da SendGrid a Gmail SMTP per le notifiche email (livello gratuito, 500 email/giorno). Corretto errore percorso build frontend che impediva la distribuzione. Il servizio email ora utilizza la password app Gmail per consegna affidabile.",
        "pt": "Mudança de SendGrid para Gmail SMTP para notificações por email (nível gratuito, 500 emails/dia). Corrigido erro de caminho de compilação do frontend que impedia a implantação. O serviço de email agora usa senha de aplicativo do Gmail para entrega confiável.",
        "pl": "Przełączenie z SendGrid na Gmail SMTP dla powiadomień e-mail (poziom bezpłatny, 500 e-maili/dzień). Naprawiono błąd ścieżki kompilacji frontendu, który uniemożliwiał wdrożenie. Usługa e-mail używa teraz hasła aplikacji Gmail dla niezawodnej dostawy."
      }
    },
    {
      "id": 40,
      "date": "2026-01-16",
      "commit": "TBD",
      "category": "Feature",
      "priority": "Medium",
      "title": "Made Charity Number Optional for VCFSE Registration",
      "description": "Removed requirement for charity commission number to allow non-registered local organizations to join the scheme",
      "details": [
        "Charity number field is now optional during VCFSE signup",
        "Removed frontend validation requiring charity number",
        "Updated backend to only verify charity number if provided",
        "Changed UI label from required (*) to (Optional)",
        "Updated help text to clarify organizations without charity numbers can register",
        "Admin dashboard still displays charity number field for tracking purposes"
      ],
      "impact": "Great local organizations without charity registration numbers can now join the BAK UP E-Voucher Scheme. The system still collects charity numbers when available for future reference and verification.",
      "affectedComponents": [
        "frontend/src/App.jsx - VCFSE signup form validation and UI",
        "backend/src/main.py - VCFSE registration validation logic"
      ],
      "userTypes": [
        "vcse",
        "admin"
      ],
      "version": "1.1.4",
      "title_ar": "جعل رقم الجمعية الخيرية اختياريًا لتسجيل VCFSE",
      "description_ar": "تمت إزالة متطلب رقم لجنة الجمعيات الخيرية للسماح للمنظمات المحلية غير المسجلة بالانضمام إلى المخطط",
      "details_ar": [
        "حقل رقم الجمعية الخيرية الآن اختياري أثناء تسجيل VCFSE",
        "تمت إزالة التحقق من الواجهة الأمامية الذي يتطلب رقم الجمعية الخيرية",
        "تم تحديث الخلفية للتحقق من رقم الجمعية الخيرية فقط إذا تم توفيره",
        "تم تغيير تسمية واجهة المستخدم من مطلوب (*) إلى (اختياري)",
        "تم تحديث نص المساعدة لتوضيح أن المنظمات بدون أرقام الجمعيات الخيرية يمكنها التسجيل",
        "لوحة الإدارة لا تزال تعرض حقل رقم الجمعية الخيرية لأغراض التتبع"
      ],
      "impact_ar": "يمكن للمنظمات المحلية الرائعة بدون أرقام تسجيل الجمعيات الخيرية الآن الانضمام إلى مخطط BAK UP E-Voucher. لا يزال النظام يجمع أرقام الجمعيات الخيرية عند توفرها للرجوع والتحقق في المستقبل.",
      "affectedComponents_ar": "frontend/src/App.jsx - نموذج تسجيل VCFSE والتحقق من صحة واجهة المستخدم، backend/src/main.py - منطق التحقق من تسجيل VCFSE",
      "title_pl": "Uczyniono numer organizacji charytatywnej opcjonalnym dla rejestracji VCFSE",
      "description_pl": "Usunięto wymóg numeru komisji charytatywnej, aby umożliwić niezarejestrowanym lokalnym organizacjom dołączenie do programu",
      "details_pl": [
        "Pole numeru organizacji charytatywnej jest teraz opcjonalne podczas rejestracji VCFSE",
        "Usunięto walidację frontendu wymagającą numeru organizacji charytatywnej",
        "Zaktualizowano backend, aby weryfikować numer organizacji charytatywnej tylko wtedy, gdy jest podany",
        "Zmieniono etykietę UI z wymagane (*) na (Opcjonalne)",
        "Zaktualizowano tekst pomocy, aby wyjaśnić, że organizacje bez numerów charytatywnych mogą się rejestrować",
        "Panel administratora nadal wyświetla pole numeru organizacji charytatywnej do celów śledzenia"
      ],
      "impact_pl": "Wspaniałe lokalne organizacje bez numerów rejestracyjnych organizacji charytatywnych mogą teraz dołączyć do programu BAK UP E-Voucher. System nadal zbiera numery organizacji charytatywnych, gdy są dostępne, do przyszłego odniesienia i weryfikacji.",
      "affectedComponents_pl": "frontend/src/App.jsx - formularz rejestracji VCFSE i walidacja UI, backend/src/main.py - logika walidacji rejestracji VCFSE",
      "title_ro": "Numărul organizației caritabile a devenit opțional pentru înregistrarea VCFSE",
      "description_ro": "Eliminat cerința numărului comisiei caritabile pentru a permite organizațiilor locale neînregistrate să se alăture schemei",
      "details_ro": [
        "Câmpul numărului organizației caritabile este acum opțional în timpul înregistrării VCFSE",
        "Eliminată validarea frontend care necesita numărul organizației caritabile",
        "Actualizat backend-ul pentru a verifica numărul organizației caritabile doar dacă este furnizat",
        "Schimbată eticheta UI de la obligatoriu (*) la (Opțional)",
        "Actualizat textul de ajutor pentru a clarifica că organizațiile fără numere caritabile se pot înregistra",
        "Panoul de administrare afișează în continuare câmpul numărului organizației caritabile în scopuri de urmărire"
      ],
      "impact_ro": "Organizațiile locale grozave fără numere de înregistrare caritabilă pot acum să se alăture schemei BAK UP E-Voucher. Sistemul colectează în continuare numerele organizațiilor caritabile când sunt disponibile pentru referință și verificare viitoare.",
      "affectedComponents_ro": "frontend/src/App.jsx - formular de înregistrare VCFSE și validare UI, backend/src/main.py - logica de validare a înregistrării VCFSE"
    },
    {
      "id": 39,
      "date": "2026-01-16",
      "commit": "TBD",
      "category": "Bug Fix",
      "priority": "High",
      "title": "Fixed EmailService Error in School Voucher Issuance",
      "description": "Resolved 'EmailService' object has no attribute 'send_batch_vouchers_email' error by implementing individual email sends for multiple vouchers",
      "details": [
        "Replaced non-existent send_batch_vouchers_email() method with loop sending individual emails",
        "Each voucher in a batch now receives its own email notification with correct amount",
        "Maintained error handling and logging for failed email sends",
        "Fixed critical bug preventing schools from issuing multiple vouchers to families"
      ],
      "impact": "Schools and Care Organizations can now successfully issue multiple vouchers to families without email service errors. Recipients receive individual email notifications for each voucher issued.",
      "affectedComponents": [
        "backend/src/main.py - school_issue_voucher function (lines 5749-5762)"
      ],
      "userTypes": [
        "school"
      ],
      "version": "1.1.3",
      "title_ar": "إصلاح خطأ EmailService في إصدار قسيمة المدرسة",
      "description_ar": "تم حل خطأ 'كائن EmailService ليس له سمة send_batch_vouchers_email' من خلال تنفيذ إرسال بريد إلكتروني فردي للقسائم المتعددة",
      "details_ar": [
        "استبدال طريقة send_batch_vouchers_email() غير الموجودة بحلقة ترسل رسائل بريد إلكتروني فردية",
        "تتلقى كل قسيمة في دفعة الآن إشعار بريد إلكتروني خاص بها بالمبلغ الصحيح",
        "الحفاظ على معالجة الأخطاء والتسجيل لإرسال البريد الإلكتروني الفاشل",
        "إصلاح خطأ حرج يمنع المدارس من إصدار قسائم متعددة للعائلات"
      ],
      "impact_ar": "يمكن للمدارس ومنظمات الرعاية الآن إصدار قسائم متعددة للعائلات بنجاح دون أخطاء خدمة البريد الإلكتروني. يتلقى المستلمون إشعارات بريد إلكتروني فردية لكل قسيمة صادرة.",
      "affectedComponents_ar": "backend/src/main.py - دالة school_issue_voucher (الأسطر 5749-5762)",
      "title_pl": "Naprawiono błąd EmailService przy wydawaniu vouchera szkolnego",
      "description_pl": "Rozwiązano błąd 'obiekt EmailService nie ma atrybutu send_batch_vouchers_email' przez implementację indywidualnych wysyłek e-mail dla wielu voucherów",
      "details_pl": [
        "Zastąpiono nieistniejącą metodę send_batch_vouchers_email() pętlą wysyłającą indywidualne e-maile",
        "Każdy voucher w partii otrzymuje teraz własne powiadomienie e-mail z poprawną kwotą",
        "Utrzymano obsługę błędów i logowanie dla nieudanych wysyłek e-mail",
        "Naprawiono krytyczny błąd uniemożliwiający szkołom wydawanie wielu voucherów rodzinom"
      ],
      "impact_pl": "Szkoły i organizacje opieki mogą teraz pomyślnie wydawać wiele voucherów rodzinom bez błędów usługi e-mail. Odbiorcy otrzymują indywidualne powiadomienia e-mail dla każdego wydanego vouchera.",
      "affectedComponents_pl": "backend/src/main.py - funkcja school_issue_voucher (linie 5749-5762)",
      "title_ro": "Corectat eroarea EmailService la emiterea voucherului școlar",
      "description_ro": "Rezolvat eroarea 'obiectul EmailService nu are atributul send_batch_vouchers_email' prin implementarea trimiterii individuale de e-mailuri pentru vouchere multiple",
      "details_ro": [
        "Înlocuit metoda inexistentă send_batch_vouchers_email() cu buclă care trimite e-mailuri individuale",
        "Fiecare voucher dintr-un lot primește acum propria notificare prin e-mail cu suma corectă",
        "Menținut gestionarea erorilor și înregistrarea pentru trimiteri de e-mail eșuate",
        "Corectat bug critic care împiedica școlile să emită vouchere multiple familiilor"
      ],
      "impact_ro": "Școlile și organizațiile de îngrijire pot acum emite cu succes vouchere multiple familiilor fără erori de serviciu e-mail. Destinatarii primesc notificări individuale prin e-mail pentru fiecare voucher emis.",
      "affectedComponents_ro": "backend/src/main.py - funcția school_issue_voucher (liniile 5749-5762)"
    },
    {
      "id": 38,
      "date": "2026-01-15",
      "commit": "TBD",
      "category": "UI Enhancement",
      "priority": "Medium",
      "title": "Fixed School Dashboard Mobile Menu Layout",
      "description": "Moved Password and Logout buttons from header into hamburger dropdown menu for better mobile UX",
      "details": [
        "Added hamburger menu button to School dashboard header (left side)",
        "Created dropdown menu containing Language selector, Version display, Change Password, and Sign Out",
        "Removed standalone Password and Logout buttons from header",
        "Improved mobile layout with cleaner header showing only hamburger menu and notification bell"
      ],
      "impact": "School dashboard now has a clean, organized mobile interface with all settings and actions accessible through a single hamburger menu, matching the UX pattern of other dashboards.",
      "affectedComponents": [
        "frontend/src/App.jsx - SchoolDashboard component"
      ],
      "userTypes": [
        "school"
      ],
      "version": "1.1.2",
      "title_ar": "إصلاح تخطيط قائمة الهاتف المحمول للوحة المدرسة",
      "description_ar": "تم نقل أزرار كلمة المرور وتسجيل الخروج من الرأس إلى قائمة الهامبرغر المنسدلة لتحسين تجربة المستخدم على الهاتف المحمول",
      "details_ar": [
        "تمت إضافة زر قائمة الهامبرغر إلى رأس لوحة المدرسة (الجانب الأيسر)",
        "تم إنشاء قائمة منسدلة تحتوي على محدد اللغة، وعرض الإصدار، وتغيير كلمة المرور، وتسجيل الخروج",
        "تمت إزالة أزرار كلمة المرور وتسجيل الخروج المستقلة من الرأس",
        "تحسين تخطيط الهاتف المحمول مع رأس أنظف يعرض فقط قائمة الهامبرغر وجرس الإشعارات"
      ],
      "impact_ar": "لدى لوحة المدرسة الآن واجهة هاتف محمول نظيفة ومنظمة مع جميع الإعدادات والإجراءات المتاحة من خلال قائمة هامبرغر واحدة، مما يطابق نمط تجربة المستخدم للوحات الأخرى.",
      "affectedComponents_ar": "frontend/src/App.jsx - مكون SchoolDashboard",
      "title_pl": "Naprawiono układ menu mobilnego panelu szkoły",
      "description_pl": "Przeniesiono przyciski Hasło i Wyloguj z nagłówka do menu rozwijanego hamburgera w celu poprawy UX mobilnego",
      "details_pl": [
        "Dodano przycisk menu hamburgera do nagłówka panelu szkoły (lewa strona)",
        "Utworzono menu rozwijane zawierające selektor języka, wyświetlanie wersji, zmianę hasła i wylogowanie",
        "Usunięto samodzielne przyciski Hasło i Wyloguj z nagłówka",
        "Ulepszono układ mobilny z czystszym nagłówkiem pokazującym tylko menu hamburgera i dzwonek powiadomień"
      ],
      "impact_pl": "Panel szkoły ma teraz czysty, zorganizowany interfejs mobilny ze wszystkimi ustawieniami i działaniami dostępnymi przez jedno menu hamburgera, zgodnie ze wzorcem UX innych paneli.",
      "affectedComponents_pl": "frontend/src/App.jsx - komponent SchoolDashboard",
      "title_ro": "Corectat aspectul meniului mobil al panoului școlii",
      "description_ro": "Mutat butoanele Parolă și Deconectare din antet în meniul derulant hamburger pentru o UX mobil mai bună",
      "details_ro": [
        "Adăugat buton de meniu hamburger în antetul panoului școlii (partea stângă)",
        "Creat meniu derulant conținând selectorul de limbă, afișarea versiunii, schimbarea parolei și deconectarea",
        "Eliminate butoanele independente Parolă și Deconectare din antet",
        "Aspect mobil îmbunătățit cu antet mai curat afișând doar meniul hamburger și clopotelul de notificări"
      ],
      "impact_ro": "Panoul școlii are acum o interfață mobilă curată și organizată cu toate setările și acțiunile accesibile printr-un singur meniu hamburger, potrivindu-se cu modelul UX al altor panouri.",
      "affectedComponents_ro": "frontend/src/App.jsx - componenta SchoolDashboard"
    },
    {
      "id": 37,
      "date": "2026-01-15",
      "commit": "TBD",
      "category": "Bug Fix",
      "priority": "High",
      "title": "Fixed Voucher Issuance DateTime Error and UI Text Display",
      "description": "Resolved datetime import scope issue causing voucher issuance failures and fixed text wrapping in Food To Go shop assignment section",
      "details": [
        "Moved datetime and other imports to top of school_issue_voucher function to prevent scope errors",
        "Fixed 'cannot access local variable datetime' error that prevented voucher issuance",
        "Added proper CSS styling (wordWrap and whiteSpace) to Food To Go shop assignment helper text",
        "Ensured text 'Choose how the shop will be assigned for discounted food items' displays completely on mobile"
      ],
      "impact": "Schools and Care Organizations can now successfully issue vouchers without datetime errors. Improved mobile UX with properly wrapped text in voucher issuance form.",
      "affectedComponents": [
        "backend/src/main.py - school_issue_voucher function",
        "frontend/src/App.jsx - Food To Go shop assignment section"
      ],
      "userTypes": [
        "school",
        "admin"
      ],
      "version": "1.1.2",
      "title_ar": "إصلاح خطأ DateTime في إصدار القسيمة وعرض نص واجهة المستخدم",
      "description_ar": "تم حل مشكلة نطاق استيراد datetime التي تسببت في فشل إصدار القسيمة وإصلاح التفاف النص في قسم تعيين المتجر للطعام للذهاب",
      "details_ar": [
        "تم نقل datetime والاستيرادات الأخرى إلى أعلى دالة school_issue_voucher لمنع أخطاء النطاق",
        "تم إصلاح خطأ 'لا يمكن الوصول إلى متغير محلي datetime' الذي منع إصدار القسيمة",
        "تمت إضافة تصميم CSS مناسب (wordWrap و whiteSpace) إلى نص المساعدة لتعيين متجر الطعام للذهاب",
        "التأكد من عرض النص 'اختر كيفية تعيين المتجر لعناصر الطعام المخفضة' بالكامل على الهاتف المحمول"
      ],
      "impact_ar": "يمكن للمدارس ومنظمات الرعاية الآن إصدار القسائم بنجاح دون أخطاء datetime. تحسين تجربة المستخدم على الهاتف المحمول مع نص ملفوف بشكل صحيح في نموذج إصدار القسيمة.",
      "affectedComponents_ar": "backend/src/main.py - دالة school_issue_voucher، frontend/src/App.jsx - قسم تعيين متجر الطعام للذهاب",
      "title_pl": "Naprawiono błąd DateTime przy wydawaniu vouchera i wyświetlanie tekstu UI",
      "description_pl": "Rozwiązano problem zakresu importu datetime powodujący niepowodzenia wydawania voucherów i naprawiono zawijanie tekstu w sekcji przypisywania sklepu Food To Go",
      "details_pl": [
        "Przeniesiono datetime i inne importy na górę funkcji school_issue_voucher, aby zapobiec błędom zakresu",
        "Naprawiono błąd 'nie można uzyskać dostępu do zmiennej lokalnej datetime', który uniemożliwiał wydawanie voucherów",
        "Dodano odpowiednie style CSS (wordWrap i whiteSpace) do tekstu pomocniczego przypisywania sklepu Food To Go",
        "Zapewniono pełne wyświetlanie tekstu 'Wybierz sposób przypisania sklepu dla produktów spożywczych ze zniżką' na urządzeniach mobilnych"
      ],
      "impact_pl": "Szkoły i organizacje opieki mogą teraz pomyślnie wydawać vouchery bez błędów datetime. Ulepszone UX mobilne z prawidłowo zawijanym tekstem w formularzu wydawania voucherów.",
      "affectedComponents_pl": "backend/src/main.py - funkcja school_issue_voucher, frontend/src/App.jsx - sekcja przypisywania sklepu Food To Go",
      "title_ro": "Corectat eroare DateTime la emiterea voucherului și afișare text UI",
      "description_ro": "Rezolvată problema de domeniu de import datetime care cauza eșecuri la emiterea voucherelor și corectat înfășurarea textului în secțiunea de atribuire magazin Food To Go",
      "details_ro": [
        "Mutat datetime și alte importuri în partea de sus a funcției school_issue_voucher pentru a preveni erori de domeniu",
        "Corectat eroarea 'nu se poate accesa variabila locală datetime' care împiedica emiterea voucherelor",
        "Adăugat stilizare CSS corespunzătoare (wordWrap și whiteSpace) la textul de ajutor pentru atribuirea magazinului Food To Go",
        "Asigurat afișarea completă a textului 'Alegeți cum va fi atribuit magazinul pentru articolele alimentare reduse' pe mobil"
      ],
      "impact_ro": "Școlile și organizațiile de îngrijire pot acum emite cu succes vouchere fără erori datetime. UX mobil îmbunătățit cu text înfășurat corect în formularul de emitere vouchere.",
      "affectedComponents_ro": "backend/src/main.py - funcția school_issue_voucher, frontend/src/App.jsx - secțiunea de atribuire magazin Food To Go"
    },
    {
      "id": 36,
      "date": "2026-01-15",
      "commit": "TBD",
      "category": "Bug Fix",
      "priority": "High",
      "title": "Fixed Duplicate Hamburger Menu in Admin Dashboard",
      "description": "Removed duplicate hamburger menu button from Admin dashboard by consolidating language selector and sign out into the left sidebar",
      "details": [
        "Removed second hamburger menu button from right side of Admin header",
        "Removed dropdown menu (language selector, version, sign out)",
        "Moved language selector into left sidebar",
        "Moved sign out button into left sidebar",
        "Removed unused menuOpen state variable",
        "Admin dashboard now has only ONE menu (left sidebar)",
        "Updated version to 1.0.10 across all locations"
      ],
      "impact": "Eliminates confusion from duplicate menu buttons on Admin dashboard desktop view. Improves code cleanliness by removing unused state variables.",
      "affectedComponents": [
        "frontend/src/App.jsx - Admin dashboard state management",
        "frontend/src/App.jsx - Admin dashboard header"
      ],
      "userTypes": [
        "admin"
      ],
      "version": "1.1.2",
      "title_ar": "إصلاح قائمة الهامبرغر المكررة في لوحة الإدارة",
      "description_ar": "تمت إزالة زر قائمة الهامبرغر المكرر من لوحة الإدارة عن طريق دمج محدد اللغة وتسجيل الخروج في الشريط الجانبي الأيسر",
      "details_ar": [
        "تمت إزالة زر قائمة الهامبرغر الثاني من الجانب الأيمن لرأس لوحة الإدارة",
        "تمت إزالة القائمة المنسدلة (محدد اللغة، الإصدار، تسجيل الخروج)",
        "تم نقل محدد اللغة إلى الشريط الجانبي الأيسر",
        "تم نقل زر تسجيل الخروج إلى الشريط الجانبي الأيسر",
        "تمت إزالة متغير حالة menuOpen غير المستخدم",
        "لوحة الإدارة الآن لديها قائمة واحدة فقط (الشريط الجانبي الأيسر)",
        "تم تحديث الإصدار إلى 1.0.10 في جميع المواقع"
      ],
      "impact_ar": "يزيل الارتباك من أزرار القائمة المكررة في عرض سطح المكتب للوحة الإدارة. يحسن نظافة الكود عن طريق إزالة متغيرات الحالة غير المستخدمة.",
      "affectedComponents_ar": "frontend/src/App.jsx - إدارة حالة لوحة الإدارة، frontend/src/App.jsx - رأس لوحة الإدارة",
      "title_pl": "Naprawiono zduplikowane menu hamburgerowe w panelu administratora",
      "description_pl": "Usunięto zduplikowany przycisk menu hamburgerowego z panelu administratora poprzez konsolidację selektora języka i wylogowania w lewym pasku bocznym",
      "details_pl": [
        "Usunięto drugi przycisk menu hamburgerowego z prawej strony nagłówka panelu administratora",
        "Usunięto menu rozwijane (selektor języka, wersja, wylogowanie)",
        "Przeniesiono selektor języka do lewego paska bocznego",
        "Przeniesiono przycisk wylogowania do lewego paska bocznego",
        "Usunięto nieużywaną zmienną stanu menuOpen",
        "Panel administratora ma teraz tylko JEDNO menu (lewy pasek boczny)",
        "Zaktualizowano wersję do 1.0.10 we wszystkich lokalizacjach"
      ],
      "impact_pl": "Eliminuje zamieszanie wynikające ze zduplikowanych przycisków menu w widoku pulpitu panelu administratora. Poprawia czystość kodu poprzez usunięcie nieużywanych zmiennych stanu.",
      "affectedComponents_pl": "frontend/src/App.jsx - zarządzanie stanem panelu administratora, frontend/src/App.jsx - nagłówek panelu administratora",
      "title_ro": "Reparat meniul hamburger duplicat în panoul de administrare",
      "description_ro": "Eliminat butonul de meniu hamburger duplicat din panoul de administrare prin consolidarea selectorului de limbă și deconectare în bara laterală stângă",
      "details_ro": [
        "Eliminat al doilea buton de meniu hamburger din partea dreaptă a antetului panoului de administrare",
        "Eliminat meniul derulant (selector de limbă, versiune, deconectare)",
        "Mutat selectorul de limbă în bara laterală stângă",
        "Mutat butonul de deconectare în bara laterală stângă",
        "Eliminat variabila de stare menuOpen nefolosită",
        "Panoul de administrare are acum doar UN singur meniu (bara laterală stângă)",
        "Actualizat versiunea la 1.0.10 în toate locațiile"
      ],
      "impact_ro": "Elimină confuzia din butoanele de meniu duplicate în vizualizarea desktop a panoului de administrare. Îmbunătățește curățenia codului prin eliminarea variabilelor de stare nefolosite.",
      "affectedComponents_ro": "frontend/src/App.jsx - gestionarea stării panoului de administrare, frontend/src/App.jsx - antetul panoului de administrare"
    },
    {
      "id": 35,
      "date": "2026-01-13",
      "commit": "8e7cd02",
      "category": "Bug Fix",
      "priority": "High",
      "title": "Fixed Menu Conflict Bug and Updated Version Display to Full System Name",
      "description": "Resolved UI conflict where left sidebar and right dropdown menu could open simultaneously, and updated version display from 'v1.0.6' to 'BAK UP E-Voucher System v1.0.9' across all dashboards",
      "details": [
        "Fixed menu conflict in Admin dashboard - left sidebar now closes when right menu opens, and vice versa",
        "Fixed menu conflict in VCFSE dashboard - left sidebar now closes when right menu opens, and vice versa",
        "Updated version text from 'v1.0.6' to 'BAK UP E-Voucher System v1.0.9' in all sidebar/menu locations",
        "Admin: Version displays at bottom of collapsible sidebar after System Changelog button",
        "VCFSE: Version displays in dropdown menu before logout button",
        "Vendor: Version displays in dropdown menu after Food To Go button",
        "Recipient: Version displays in dropdown menu before logout button",
        "School: Version displays in header area near logout button",
        "Implemented mutual exclusion logic: setSidebarOpen closes menuOpen and vice versa",
        "Prevents UI overlap and improves user experience"
      ],
      "impact": "Eliminates confusing UI behavior where multiple menus could overlap, improving navigation clarity. Full system name in version display provides better branding and clearer version identification for all user types.",
      "affectedComponents": [
        "frontend/src/App.jsx - Admin dashboard menu handlers",
        "frontend/src/App.jsx - VCFSE dashboard menu handlers",
        "frontend/src/App.jsx - All version display text (5 locations)"
      ],
      "userTypes": [
        "admin",
        "vcse",
        "vendor",
        "recipient",
        "school"
      ],
      "version": "1.1.2",
      "title_ar": "إصلاح خطأ تعارض القائمة وتحديث عرض الإصدار إلى اسم النظام الكامل",
      "description_ar": "تم حل تعارض واجهة المستخدم حيث يمكن فتح الشريط الجانبي الأيسر والقائمة المنسدلة اليمنى في وقت واحد، وتم تحديث عرض الإصدار من 'v1.0.6' إلى 'BAK UP E-Voucher System v1.0.9' عبر جميع لوحات المعلومات",
      "details_ar": [
        "تم إصلاح تعارض القائمة في لوحة الإدارة - يغلق الشريط الجانبي الأيسر الآن عند فتح القائمة اليمنى، والعكس صحيح",
        "تم إصلاح تعارض القائمة في لوحة VCFSE - يغلق الشريط الجانبي الأيسر الآن عند فتح القائمة اليمنى، والعكس صحيح",
        "تم تحديث نص الإصدار من 'v1.0.6' إلى 'BAK UP E-Voucher System v1.0.9' في جميع مواقع الشريط الجانبي/القائمة",
        "المسؤول: يعرض الإصدار في أسفل الشريط الجانبي القابل للطي بعد زر سجل تغييرات النظام",
        "VCFSE: يعرض الإصدار في القائمة المنسدلة قبل زر تسجيل الخروج",
        "البائع: يعرض الإصدار في القائمة المنسدلة بعد زر الطعام للذهاب",
        "المستلم: يعرض الإصدار في القائمة المنسدلة قبل زر تسجيل الخروج",
        "المدرسة: يعرض الإصدار في منطقة الرأس بالقرب من زر تسجيل الخروج",
        "تم تنفيذ منطق الاستبعاد المتبادل: setSidebarOpen يغلق menuOpen والعكس صحيح",
        "يمنع تداخل واجهة المستخدم ويحسن تجربة المستخدم"
      ],
      "impact_ar": "يزيل سلوك واجهة المستخدم المربك حيث يمكن أن تتداخل قوائم متعددة، مما يحسن وضوح التنقل. الاسم الكامل للنظام في عرض الإصدار يوفر علامة تجارية أفضل وتحديد إصدار أوضح لجميع أنواع المستخدمين.",
      "affectedComponents_ar": "frontend/src/App.jsx - معالجات قائمة لوحة الإدارة، معالجات قائمة لوحة VCFSE، جميع نصوص عرض الإصدار (5 مواقع)",
      "title_pl": "Naprawiono błąd konfliktu menu i zaktualizowano wyświetlanie wersji do pełnej nazwy systemu",
      "description_pl": "Rozwiązano konflikt interfejsu użytkownika, w którym lewy pasek boczny i prawe menu rozwijane mogły otworzyć się jednocześnie, oraz zaktualizowano wyświetlanie wersji z 'v1.0.6' na 'BAK UP E-Voucher System v1.0.9' we wszystkich pulpitach",
      "details_pl": [
        "Naprawiono konflikt menu w pulpicie administratora - lewy pasek boczny zamyka się teraz po otwarciu prawego menu i odwrotnie",
        "Naprawiono konflikt menu w pulpicie VCFSE - lewy pasek boczny zamyka się teraz po otwarciu prawego menu i odwrotnie",
        "Zaktualizowano tekst wersji z 'v1.0.6' na 'BAK UP E-Voucher System v1.0.9' we wszystkich lokalizacjach paska bocznego/menu",
        "Administrator: Wersja wyświetla się na dole zwijane go paska bocznego po przycisku System Changelog",
        "VCFSE: Wersja wyświetla się w menu rozwijanym przed przyciskiem wylogowania",
        "Sprzedawca: Wersja wyświetla się w menu rozwijanym po przycisku Food To Go",
        "Odbiorca: Wersja wyświetla się w menu rozwijanym przed przyciskiem wylogowania",
        "Szkoła: Wersja wyświetla się w obszarze nagłówka w pobliżu przycisku wylogowania",
        "Zaimplementowano logikę wzajemnego wykluczania: setSidebarOpen zamyka menuOpen i odwrotnie",
        "Zapobiega nakładaniu się interfejsu użytkownika i poprawia doświadczenie użytkownika"
      ],
      "impact_pl": "Eliminuje mylące zachowanie interfejsu użytkownika, w którym wiele menu mogło się nakładać, poprawiając przejrzystość nawigacji. Pełna nazwa systemu w wyświetlaniu wersji zapewnia lepszy branding i wyraźniejszą identyfikację wersji dla wszystkich typów użytkowników.",
      "affectedComponents_pl": "frontend/src/App.jsx - obsługa menu pulpitu administratora, obsługa menu pulpitu VCFSE, wszystkie teksty wyświetlania wersji (5 lokalizacji)",
      "title_ro": "Remediat bug-ul de conflict de meniu și actualizat afișarea versiunii la numele complet al sistemului",
      "description_ro": "Rezolvat conflictul UI unde bara laterală stângă și meniul drop-down drept puteau fi deschise simultan, și actualizat afișarea versiunii de la 'v1.0.6' la 'BAK UP E-Voucher System v1.0.9' pe toate panourile de control",
      "details_ro": [
        "Remediat conflictul de meniu în panoul de administrare - bara laterală stângă se închide acum când se deschide meniul drept și invers",
        "Remediat conflictul de meniu în panoul VCFSE - bara laterală stângă se închide acum când se deschide meniul drept și invers",
        "Actualizat textul versiunii de la 'v1.0.6' la 'BAK UP E-Voucher System v1.0.9' în toate locațiile barei laterale/meniului",
        "Administrator: Versiunea se afișează în partea de jos a barei laterale pliabile după butonul System Changelog",
        "VCFSE: Versiunea se afișează în meniul drop-down înainte de butonul de deconectare",
        "Vânzător: Versiunea se afișează în meniul drop-down după butonul Food To Go",
        "Destinatar: Versiunea se afișează în meniul drop-down înainte de butonul de deconectare",
        "Școală: Versiunea se afișează în zona antetului lângă butonul de deconectare",
        "Implementată logica de excludere mutuală: setSidebarOpen închide menuOpen și invers",
        "Previne suprapunerea UI și îmbunătățește experiența utilizatorului"
      ],
      "impact_ro": "Elimină comportamentul confuz al UI unde mai multe meniuri se puteau suprapune, îmbunătățind claritatea navigării. Numele complet al sistemului în afișarea versiunii oferă un branding mai bun și o identificare mai clară a versiunii pentru toate tipurile de utilizatori.",
      "affectedComponents_ro": "frontend/src/App.jsx - gestionare meniu panou administrare, gestionare meniu panou VCFSE, toate textele de afișare versiune (5 locații)"
    },
    {
      "id": 34,
      "date": "2026-01-13",
      "commit": "5c4dc66",
      "category": "Bug Fix",
      "priority": "Medium",
      "title": "Fixed Changelog Version Display to Show Individual Entry Versions",
      "description": "Corrected changelog display bug where all entries showed system version (1.0.6) instead of their individual implementation versions",
      "details": [
        "Fixed line 4258 in App.jsx to use change.version instead of changelog.version",
        "Each changelog entry now displays its actual implementation version",
        "Entry #33 displays v1.0.5 (latest)",
        "Entries #29-32 display v1.0.4",
        "Entries #21-28 display v1.0.3",
        "Entries #1-20 display v1.0.2",
        "Provides accurate version history for stakeholder presentations",
        "Verified working in production deployment"
      ],
      "impact": "Changelog now provides accurate version tracking, showing when each feature was actually implemented rather than displaying the current system version for all entries. This improves transparency and makes it easier to track feature evolution across versions.",
      "affectedComponents": [
        "frontend/src/App.jsx - Changelog display component (line 4258)"
      ],
      "userTypes": [
        "admin"
      ],
      "version": "1.0.6",
      "title_ar": "إصلاح عرض إصدار سجل التغييرات لإظهار إصدارات الإدخالات الفردية",
      "description_ar": "تم تصحيح خطأ في عرض سجل التغييرات حيث كانت جميع الإدخالات تعرض إصدار النظام (1.0.6) بدلاً من إصدارات التنفيذ الفردية الخاصة بها",
      "details_ar": [
        "تم إصلاح السطر 4258 في App.jsx لاستخدام change.version بدلاً من changelog.version",
        "يعرض كل إدخال في سجل التغييرات الآن إصدار التنفيذ الفعلي الخاص به",
        "يعرض الإدخال رقم 33 الإصدار v1.0.5 (الأحدث)",
        "تعرض الإدخالات #29-32 الإصدار v1.0.4",
        "تعرض الإدخالات #21-28 الإصدار v1.0.3",
        "تعرض الإدخالات #1-20 الإصدار v1.0.2",
        "يوفر سجل إصدارات دقيق لعروض أصحاب المصلحة",
        "تم التحقق من العمل في النشر الإنتاجي"
      ],
      "impact_ar": "يوفر سجل التغييرات الآن تتبعًا دقيقًا للإصدارات، ويظهر متى تم تنفيذ كل ميزة فعليًا بدلاً من عرض إصدار النظام الحالي لجميع الإدخالات. يحسن هذا الشفافية ويسهل تتبع تطور الميزات عبر الإصدارات.",
      "affectedComponents_ar": "frontend/src/App.jsx - مكون عرض سجل التغييرات (السطر 4258)",
      "title_pl": "Naprawiono wyświetlanie wersji w Changelog, aby pokazywało wersje poszczególnych wpisów",
      "description_pl": "Poprawiono błąd wyświetlania changelogu, w którym wszystkie wpisy pokazywały wersję systemu (1.0.6) zamiast ich indywidualnych wersji implementacji",
      "details_pl": [
        "Naprawiono linię 4258 w pliku App.jsx, aby używała change.version zamiast changelog.version",
        "Każdy wpis w changelogu teraz wyświetla swoją rzeczywistą wersję implementacji",
        "Wpis #33 wyświetla wersję v1.0.5 (najnowsza)",
        "Wpisy #29-32 wyświetlają wersję v1.0.4",
        "Wpisy #21-28 wyświetlają wersję v1.0.3",
        "Wpisy #1-20 wyświetlają wersję v1.0.2",
        "Zapewnia dokładną historię wersji do prezentacji dla interesariuszy",
        "Zweryfikowano działanie w środowisku produkcyjnym"
      ],
      "impact_pl": "Changelog teraz zapewnia dokładne śledzenie wersji, pokazując, kiedy każda funkcja została faktycznie zaimplementowana, zamiast wyświetlać bieżącą wersję systemu dla wszystkich wpisów. Poprawia to przejrzystość i ułatwia śledzenie ewolucji funkcji w kolejnych wersjach.",
      "affectedComponents_pl": "frontend/src/App.jsx - Komponent wyświetlający changelog (linia 4258)",
      "title_ro": "Corectat afișarea versiunii în Changelog pentru a arăta versiunile individuale ale intrărilor",
      "description_ro": "Corectată eroarea de afișare a changelog-ului unde toate intrările afișau versiunea sistemului (1.0.6) în loc de versiunile lor individuale de implementare",
      "impact_ro": "Changelog-ul oferă acum o urmărire precisă a versiunilor, arătând când a fost implementată efectiv fiecare funcționalitate, în loc să afișeze versiunea curentă a sistemului pentru toate intrările. Aceasta îmbunătățește transparența și facilitează urmărirea evoluției funcționalităților între versiuni.",
      "details_ro": [
        "Fixat linia 4258 în App.jsx pentru a folosi change.version în loc de changelog.version",
        "Fiecare intrare din changelog afișează acum versiunea sa reală de implementare",
        "Intrarea #33 afișează v1.0.5 (ultima)",
        "Intrările #29-32 afișează v1.0.4",
        "Intrările #21-28 afișează v1.0.3",
        "Intrările #1-20 afișează v1.0.2",
        "Oferă o istorie precisă a versiunilor pentru prezentările către stakeholderi",
        "Verificat funcționarea în implementarea de producție"
      ],
      "affectedComponents_ro": "frontend/src/App.jsx - componenta de afișare a changelog-ului (linia 4258)"
    },
    {
      "id": 33,
      "date": "2026-01-12",
      "commit": "e9eca5a",
      "category": "Feature",
      "priority": "High",
      "title": "VCSE Surplus Food Acceptance Workflow Complete",
      "description": "Implemented complete VCSE acceptance workflow for surplus food items with collection time scheduling, status tracking, and real-time notifications",
      "details": [
        "Added new 'Surplus Food Collection' tab to VCSE dashboard",
        "VCSE can view all available surplus food items from vendors",
        "Accept button allows VCSE to claim items for collection",
        "Collection time picker modal for scheduling pickup",
        "Real-time notifications to vendor when item accepted",
        "VCSE can view accepted items with collection details",
        "Mark as Collected button to confirm pickup",
        "Admin dashboard shows acceptance status and VCSE organization",
        "Vendor receives notification when items collected",
        "Database migration adds 4 new fields to surplus_item table",
        "Complete status workflow: available → accepted → collected",
        "Full audit trail of acceptance and collection"
      ],
      "impact": "VCSE organizations can now accept surplus food items from vendors, schedule collection times, and coordinate food distribution to beneficiaries. Completes user feature request #7 at 100%.",
      "affectedComponents": [
        "frontend/src/App.jsx - VCSEDashboard (new tab + modal)",
        "frontend/src/App.jsx - AdminDashboard (acceptance status)",
        "backend/src/main.py - 3 new API endpoints",
        "backend/src/main.py - SurplusItem model (4 new fields)",
        "backend/migrations/add_food_acceptance_fields.py"
      ],
      "userTypes": [
        "vcse",
        "vendor",
        "admin"
      ],
      "version": "1.0.5",
      "title_ar": "اكتمال سير عمل قبول الطعام الفائض من VCSE",
      "description_ar": "تم تنفيذ سير عمل قبول VCSE الكامل لعناصر الطعام الفائض مع جدولة وقت التحصيل وتتبع الحالة والإشعارات في الوقت الفعلي",
      "details_ar": [
        "تمت إضافة علامة تبويب جديدة 'تحصيل الطعام الفائض' إلى لوحة تحكم VCSE",
        "يمكن لـ VCSE عرض جميع عناصر الطعام الفائض المتاحة من البائعين",
        "زر القبول يسمح لـ VCSE بالمطالبة بالعناصر للتحصيل",
        "نافذة منبثقة لاختيار وقت التحصيل لجدولة الاستلام",
        "إشعارات في الوقت الفعلي للبائع عند قبول العنصر",
        "يمكن لـ VCSE عرض العناصر المقبولة مع تفاصيل التحصيل",
        "زر تم التحصيل لتأكيد الاستلام",
        "تعرض لوحة تحكم المسؤول حالة القبول ومنظمة VCSE",
        "يتلقى البائع إشعارًا عند تحصيل العناصر",
        "ترحيل قاعدة البيانات يضيف 4 حقول جديدة إلى جدول surplus_item",
        "سير عمل الحالة الكامل: متاح ← مقبول ← تم التحصيل",
        "مسار تدقيق كامل للقبول والتحصيل"
      ],
      "impact_ar": "يمكن لمنظمات VCSE الآن قبول عناصر الطعام الفائض من البائعين وجدولة أوقات التحصيل وتنسيق توزيع الطعام للمستفيدين. يكمل طلب ميزة المستخدم رقم 7 بنسبة 100٪.",
      "affectedComponents_ar": "frontend/src/App.jsx - VCSEDashboard (علامة تبويب جديدة + نافذة منبثقة), frontend/src/App.jsx - AdminDashboard (حالة القبول), backend/src/main.py - 3 نقاط نهاية API جديدة, backend/src/main.py - نموذج SurplusItem (4 حقول جديدة), backend/migrations/add_food_acceptance_fields.py",
      "title_pl": "Workflow Akceptacji Nadwyżek Żywności VCSE Zakończony",
      "description_pl": "Wdrożono kompletny workflow akceptacji VCSE dla nadwyżek żywności z harmonogramowaniem czasu odbioru, śledzeniem statusu oraz powiadomieniami w czasie rzeczywistym",
      "details_pl": [
        "Dodano nową zakładkę 'Surplus Food Collection' do panelu VCSE",
        "VCSE może przeglądać wszystkie dostępne nadwyżki żywności od dostawców",
        "Przycisk Accept pozwala VCSE na zgłaszanie przedmiotów do odbioru",
        "Modal wyboru czasu odbioru dla planowania odbioru",
        "Powiadomienia w czasie rzeczywistym do vendor po zaakceptowaniu itemu",
        "VCSE może przeglądać zaakceptowane elementy wraz ze szczegółami kolekcji",
        "Przycisk Mark as Collected do potwierdzenia odbioru",
        "Panel administracyjny wyświetla status akceptacji oraz organizację VCSE",
        "Dostawca otrzymuje powiadomienie, gdy przedmioty zostaną odebrane",
        "Migracja bazy danych dodaje 4 nowe pola do tabeli surplus_item",
        "Kompletny workflow statusu: available → accepted → collected",
        "Pełny audyt ścieżki akceptacji i zbierania danych"
      ],
      "impact_pl": "Organizacje VCSE mogą teraz przyjmować nadwyżki żywności od dostawców, planować terminy odbioru oraz koordynować dystrybucję żywności do beneficjentów. Realizacja żądania funkcji użytkownika #7 została ukończona w 100%.",
      "affectedComponents_pl": "frontend/src/App.jsx - VCSEDashboard (nowa karta + modal), frontend/src/App.jsx - AdminDashboard (status akceptacji), backend/src/main.py - 3 nowe API endpoints, backend/src/main.py - model SurplusItem (4 nowe pola), backend/migrations/add_food_acceptance_fields.py",
      "title_ro": "Fluxul de lucru pentru acceptarea surplusului de alimente VCSE complet",
      "description_ro": "Implementat fluxul complet de acceptare VCSE pentru articolele de surplus alimentar cu programarea orei de colectare, urmărirea stadiului și notificări în timp real",
      "impact_ro": "Organizațiile VCSE pot acum accepta articole de surplus alimentar de la furnizori, pot programa orele de colectare și pot coordona distribuția alimentelor către beneficiari. Finalizează cererea de funcționalitate a utilizatorului #7 în proporție de 100%.",
      "details_ro": [
        "Adăugat noul tab 'Surplus Food Collection' în dashboard-ul VCSE",
        "VCSE poate vizualiza toate articolele disponibile de surplus alimentar de la furnizori",
        "Butonul Accept permite VCSE să revendice articole pentru colectare",
        "Modal pentru alegerea orei de colectare pentru programarea ridicării",
        "Notificări în timp real către furnizor când un articol este acceptat",
        "VCSE poate vizualiza articolele acceptate cu detalii despre colectare",
        "Butonul Mark as Collected pentru confirmarea ridicării",
        "Dashboard-ul Admin afișează stadiul acceptării și organizația VCSE",
        "Furnizorul primește notificare când articolele sunt colectate",
        "Migrarea bazei de date adaugă 4 câmpuri noi în tabelul surplus_item",
        "Flux complet al stadiilor: available → accepted → collected",
        "Traseu complet de audit pentru acceptare și colectare"
      ],
      "affectedComponents_ro": "frontend/src/App.jsx - VCSEDashboard (tab nou + modal), frontend/src/App.jsx - AdminDashboard (stadiu acceptare), backend/src/main.py - 3 noi API endpoints, backend/src/main.py - model SurplusItem (4 câmpuri noi), backend/migrations/add_food_acceptance_fields.py"
    },
    {
      "id": 32,
      "date": "2026-01-12",
      "commit": "e08032a",
      "category": "Deployment",
      "priority": "Critical",
      "title": "Database Migration Successfully Completed",
      "description": "Successfully ran database migration to create redemption_request table with all required fields and indexes",
      "details": [
        "Migration script executed successfully in production",
        "Created redemption_request table with 11 columns",
        "Created 6 indexes for optimal query performance",
        "Verified table structure matches SQLAlchemy model",
        "All foreign key references validated",
        "2-step redemption workflow now fully operational"
      ],
      "impact": "The 2-step voucher redemption workflow is now live in production. Recipients can approve/reject redemption requests, and shop owners can request partial redemptions.",
      "affectedComponents": [
        "Database - redemption_request table",
        "Database - 6 performance indexes"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.4",
      "title_ar": "اكتمال ترحيل قاعدة البيانات بنجاح",
      "description_ar": "تم تشغيل نص ترحيل قاعدة البيانات بنجاح لإنشاء جدول redemption_request مع جميع الحقول والفهارس المطلوبة",
      "details_ar": [
        "تم تنفيذ نص الترحيل بنجاح في الإنتاج",
        "تم إنشاء جدول redemption_request مع 11 عمودًا",
        "تم إنشاء 6 فهارس لأداء الاستعلام الأمثل",
        "تم التحقق من أن بنية الجدول تطابق نموذج SQLAlchemy",
        "تم التحقق من صحة جميع مراجع المفاتيح الأجنبية",
        "سير عمل الاسترداد المكون من خطوتين يعمل الآن بالكامل"
      ],
      "impact_ar": "سير عمل استرداد القسيمة المكون من خطوتين متاح الآن في الإنتاج. يمكن للمستلمين الموافقة على طلبات الاسترداد أو رفضها، ويمكن لأصحاب المتاجر طلب استردادات جزئية.",
      "affectedComponents_ar": "Database - جدول redemption_request, Database - 6 فهارس أداء",
      "title_pl": "Migracja bazy danych zakończona pomyślnie",
      "description_pl": "Pomyślnie przeprowadzono migrację bazy danych w celu utworzenia tabeli redemption_request ze wszystkimi wymaganymi polami i indeksami.",
      "details_pl": [
        "Skrypt migracji został pomyślnie wykonany w środowisku produkcyjnym",
        "Utworzono tabelę redemption_request z 11 kolumnami",
        "Utworzono 6 indeksów dla optymalnej wydajności zapytań",
        "Zweryfikowano, że struktura tabeli odpowiada modelowi SQLAlchemy",
        "Wszystkie odwołania do kluczy obcych zostały zweryfikowane",
        "Dwustopniowy proces realizacji teraz w pełni operacyjny"
      ],
      "impact_pl": "Dwustopniowy proces realizacji voucherów jest teraz dostępny w produkcji. Odbiorcy mogą zatwierdzać lub odrzucać prośby o realizację, a właściciele sklepów mogą zgłaszać częściowe realizacje.",
      "affectedComponents_pl": "Baza danych - tabela redemption_request, Baza danych - 6 indeksów wydajnościowych",
      "title_ro": "Migrarea bazei de date a fost finalizată cu succes",
      "description_ro": "Migrarea bazei de date pentru crearea tabelului redemption_request cu toate câmpurile și indexurile necesare a fost realizată cu succes",
      "impact_ro": "Fluxul de lucru în 2 pași pentru răscumpărarea voucherelor este acum activ în producție. Beneficiarii pot aproba/resping solicitările de răscumpărare, iar proprietarii magazinelor pot solicita răscumpărări parțiale.",
      "details_ro": [
        "Scriptul de migrare a fost executat cu succes în producție",
        "Tabelul redemption_request a fost creat cu 11 coloane",
        "Au fost create 6 indexuri pentru performanță optimă a interogărilor",
        "Structura tabelului a fost verificată și corespunde modelului SQLAlchemy",
        "Toate referințele cheilor externe au fost validate",
        "Fluxul de lucru în 2 pași pentru răscumpărare este acum complet operațional"
      ],
      "affectedComponents_ro": "Database - tabelul redemption_request, Database - 6 indexuri de performanță"
    },
    {
      "id": 31,
      "date": "2026-01-12",
      "commit": "e08032a",
      "category": "Bug Fix",
      "priority": "Critical",
      "title": "Fixed Duplicate Variable Declarations Causing Deployment Failure",
      "description": "Removed duplicate state variable declarations in RecipientDashboard that caused build failure and prevented deployment",
      "details": [
        "Removed duplicate showMenuDropdown and showProfileModal declarations",
        "Variables were already declared earlier in the component (lines 7676-7677)",
        "Duplicate declarations at lines 7982-7983 caused 'symbol already declared' error",
        "Build error prevented Render deployment from succeeding",
        "Fixed syntax error that blocked production deployment",
        "Build now completes successfully without errors"
      ],
      "impact": "Fixed critical deployment blocker. System can now deploy successfully to production.",
      "affectedComponents": [
        "frontend/src/App.jsx - RecipientDashboard component"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.4",
      "title_ar": "إصلاح تصريحات المتغيرات المكررة التي تسببت في فشل النشر",
      "description_ar": "تمت إزالة تصريحات متغيرات الحالة المكررة في RecipientDashboard التي تسببت في فشل البناء ومنعت النشر",
      "details_ar": [
        "تمت إزالة تصريحات showMenuDropdown و showProfileModal المكررة",
        "كانت المتغيرات قد تم تصريحها بالفعل في وقت سابق في المكون (الأسطر 7676-7677)",
        "تسببت التصريحات المكررة في الأسطر 7982-7983 في خطأ 'الرمز تم تصريحه بالفعل'",
        "منع خطأ البناء نجاح نشر Render",
        "تم إصلاح خطأ بناء منع النشر الإنتاجي",
        "يكتمل البناء الآن بنجاح بدون أخطاء"
      ],
      "impact_ar": "تم إصلاح عائق النشر الحرج. يمكن للنظام الآن النشر بنجاح إلى الإنتاج.",
      "affectedComponents_ar": "frontend/src/App.jsx - مكون RecipientDashboard",
      "title_pl": "Naprawiono powielone deklaracje zmiennych powodujące błąd wdrożenia",
      "description_pl": "Usunięto zduplikowane deklaracje zmiennych stanu w RecipientDashboard, które powodowały błąd kompilacji i uniemożliwiały wdrożenie",
      "details_pl": [
        "Usunięto zduplikowane deklaracje showMenuDropdown oraz showProfileModal",
        "Zmienne zostały już zadeklarowane wcześniej w komponencie (linie 7676-7677)",
        "Duplikaty deklaracji w liniach 7982-7983 spowodowały błąd 'symbol already declared'",
        "Błąd kompilacji uniemożliwił pomyślne wdrożenie Render.",
        "Naprawiono błąd składniowy, który blokował wdrożenie na produkcję",
        "Kompilacja teraz kończy się pomyślnie bez błędów"
      ],
      "impact_pl": "Naprawiono krytyczny problem blokujący wdrożenie. System może teraz pomyślnie wdrożyć się do produkcji.",
      "affectedComponents_pl": "frontend/src/App.jsx - komponent RecipientDashboard",
      "title_ro": "Corectate declarațiile duplicate de variabile care cauzau eșecul implementării",
      "description_ro": "Eliminate declarațiile duplicate ale variabilelor de stare în RecipientDashboard care cauzau eșecul build-ului și împiedicau implementarea",
      "impact_ro": "Blocator critic de implementare rezolvat. Sistemul poate acum să implementeze cu succes în producție.",
      "details_ro": [
        "Eliminate declarațiile duplicate showMenuDropdown și showProfileModal",
        "Variabilele erau deja declarate anterior în componentă (liniile 7676-7677)",
        "Declarațiile duplicate de la liniile 7982-7983 au cauzat eroarea 'symbol already declared'",
        "Eroarea de build a împiedicat succesul implementării Render",
        "Corectată eroarea de sintaxă care bloca implementarea în producție",
        "Build-ul se finalizează acum cu succes, fără erori"
      ],
      "affectedComponents_ro": "frontend/src/App.jsx - componenta RecipientDashboard"
    },
    {
      "id": 30,
      "date": "2026-01-12",
      "commit": "0ec3567",
      "category": "Bug Fix",
      "priority": "Critical",
      "title": "Fixed Database Migration Script Table Name References",
      "description": "Corrected table name references in migration script to match SQLAlchemy model definitions and PostgreSQL schema",
      "details": [
        "Changed table name from 'redemption_requests' (plural) to 'redemption_request' (singular)",
        "Fixed foreign key reference from 'vouchers(id)' to 'voucher(id)' (singular)",
        "Fixed foreign key reference from 'users(id)' to '\"user\"(id)' (singular with quotes for reserved keyword)",
        "Added missing 'shop_id' field that exists in RedemptionRequest model",
        "Added missing 'expires_at' field for auto-expiration functionality",
        "Updated all index names to match singular table name",
        "Fixed syntax error (extra parenthesis in print statement)",
        "Added shop_id index for query optimization"
      ],
      "impact": "Migration script now matches actual database schema. Fixed 'relation does not exist' error that prevented table creation.",
      "affectedComponents": [
        "backend/migrations/add_redemption_requests_table.py"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.4",
      "title_ar": "إصلاح مراجع أسماء الجداول في نص ترحيل قاعدة البيانات",
      "description_ar": "تم تصحيح مراجع أسماء الجداول في نص الترحيل لتتطابق مع تعريفات نموذج SQLAlchemy ومخطط PostgreSQL",
      "details_ar": [
        "تم تغيير اسم الجدول من 'redemption_requests' (جمع) إلى 'redemption_request' (مفرد)",
        "تم إصلاح مرجع المفتاح الأجنبي من 'vouchers(id)' إلى 'voucher(id)' (مفرد)",
        "تم إصلاح مرجع المفتاح الأجنبي من 'users(id)' إلى '\"user\"(id)' (مفرد مع علامات اقتباس للكلمة المحجوزة)",
        "تمت إضافة حقل 'shop_id' المفقود الموجود في نموذج RedemptionRequest",
        "تمت إضافة حقل 'expires_at' المفقود لوظيفة انتهاء الصلاحية التلقائي",
        "تم تحديث جميع أسماء الفهارس لتتطابق مع اسم الجدول المفرد",
        "تم إصلاح خطأ بناء (قوس إضافي في بيان الطباعة)",
        "تمت إضافة فهرس shop_id لتحسين الاستعلام"
      ],
      "impact_ar": "يتطابق نص الترحيل الآن مع مخطط قاعدة البيانات الفعلي. تم إصلاح خطأ 'العلاقة غير موجودة' الذي منع إنشاء الجدول.",
      "affectedComponents_ar": "backend/migrations/add_redemption_requests_table.py",
      "title_pl": "Naprawiono odwołania do nazw tabel w skrypcie migracji bazy danych",
      "description_pl": "Poprawiono odniesienia do nazw tabel w skrypcie migracyjnym, aby odpowiadały definicjom modeli SQLAlchemy oraz schematowi PostgreSQL",
      "details_pl": [
        "Zmieniono nazwę tabeli z 'redemption_requests' (liczba mnoga) na 'redemption_request' (liczba pojedyncza)",
        "Naprawiono odwołanie klucza obcego z 'vouchers(id)' na 'voucher(id)' (liczba pojedyncza)",
        "Naprawiono odwołanie klucza obcego z 'users(id)' na '\"user\"(id)' (liczba pojedyncza z cudzysłowami dla zarezerwowanego słowa)",
        "Dodano brakujące pole 'shop_id', które istnieje w modelu RedemptionRequest",
        "Dodano brakujące pole 'expires_at' dla funkcji automatycznego wygasania",
        "Zaktualizowano wszystkie nazwy indeksów, aby odpowiadały nazwie tabeli w liczbie pojedynczej",
        "Naprawiono błąd składniowy (nadmiarowy nawias w instrukcji print)",
        "Dodano indeks shop_id w celu optymalizacji zapytań"
      ],
      "impact_pl": "Skrypt migracji jest teraz zgodny z aktualnym schematem bazy danych. Naprawiono błąd „relation does not exist”, który uniemożliwiał tworzenie tabeli.",
      "affectedComponents_pl": "backend/migrations/add_redemption_requests_table.py",
      "title_ro": "Script de migrare a bazei de date: corectarea referințelor la numele tabelelor",
      "description_ro": "Corectate referințele la numele tabelelor în scriptul de migrare pentru a corespunde definițiilor modelelor SQLAlchemy și schemei PostgreSQL",
      "impact_ro": "Scriptul de migrare corespunde acum schemei reale a bazei de date. Corectată eroarea 'relation does not exist' care împiedica crearea tabelului.",
      "details_ro": [
        "Numele tabelului schimbat din 'redemption_requests' (plural) în 'redemption_request' (singular)",
        "Corectată referința cheii externe de la 'vouchers(id)' la 'voucher(id)' (singular)",
        "Corectată referința cheii externe de la 'users(id)' la '\"user\"(id)' (singular cu ghilimele pentru cuvânt rezervat)",
        "Adăugat câmpul lipsă 'shop_id' care există în modelul RedemptionRequest",
        "Adăugat câmpul lipsă 'expires_at' pentru funcționalitatea de expirare automată",
        "Actualizate toate numele indexurilor pentru a corespunde numelui tabelului la singular",
        "Corectată eroarea de sintaxă (paranteză suplimentară în instrucțiunea print)",
        "Adăugat index pentru shop_id pentru optimizarea interogărilor"
      ],
      "affectedComponents_ro": "backend/migrations/add_redemption_requests_table.py"
    },
    {
      "id": 29,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "Feature",
      "priority": "Critical",
      "title": "2-Step Voucher Redemption Workflow with Recipient Approval",
      "description": "Complete redesign of voucher redemption system based on critical user feedback - shop owners can now request partial redemptions, and recipients must approve each redemption request in real-time",
      "details": [
        "Added RedemptionRequest database model to track pending redemption requests",
        "Shop owners can now enter custom redemption amount (partial redemption support)",
        "Modified /vendor/redeem-voucher endpoint to create pending requests instead of immediate redemption",
        "Added /api/recipient/redemption-requests endpoint to fetch pending requests",
        "Added /api/recipient/redemption-requests/<id>/respond endpoint for approve/reject actions",
        "Implemented real-time Socket.IO event 'redemption_request' to notify recipients instantly",
        "Created beautiful redemption approval modal in RecipientDashboard with shop details, amount, and balance info",
        "Added approve/reject buttons with reason input for rejections",
        "Added auto-expiration timer (5 minutes) for pending requests",
        "Recipients can see time remaining for each request",
        "Vendor receives real-time notification when recipient approves/rejects",
        "Updated VendorDashboard success message to indicate 'request sent' instead of 'redeemed'",
        "Added pending redemption requests counter in RecipientDashboard",
        "Implemented queue system for multiple simultaneous redemption requests",
        "Added database migration script for RedemptionRequest table"
      ],
      "impact": "CRITICAL USER FEEDBACK ADDRESSED: (1) Shop owners can now redeem only actual purchase amount instead of full voucher, (2) Recipients have full control and must approve each redemption, (3) Prevents unauthorized full-voucher redemptions. This fundamentally changes the redemption workflow to be recipient-centric and secure.",
      "affectedComponents": [
        "backend/models.py - Added RedemptionRequest model",
        "backend/app.py - Modified redemption endpoints and added approval endpoints",
        "frontend/src/App.jsx - RecipientDashboard redemption approval UI",
        "frontend/src/App.jsx - VendorDashboard partial amount input",
        "Socket.IO - Added redemption_request and redemption_response events"
      ],
      "userTypes": [
        "recipient",
        "vendor"
      ],
      "breakingChange": true,
      "migrationRequired": true,
      "version": "1.0.4",
      "title_ar": "سير عمل استرداد القسيمة بخطوتين مع موافقة المستلم",
      "description_ar": "إعادة تصميم كاملة لنظام استرداد القسائم بناءً على ملاحظات المستخدمين الهامة - يمكن لأصحاب المتاجر الآن طلب استردادات جزئية، ويجب على المستلمين الموافقة على كل طلب استرداد في الوقت الفعلي",
      "details_ar": [
        "تمت إضافة نموذج قاعدة بيانات RedemptionRequest لتتبع طلبات الاسترداد المعلقة",
        "يمكن لأصحاب المتاجر الآن إدخال مبلغ استرداد مخصص (دعم الاسترداد الجزئي)",
        "تم تعديل نقطة النهاية /vendor/redeem-voucher لإنشاء طلبات معلقة بدلاً من الاسترداد الفوري",
        "تمت إضافة نقطة النهاية /api/recipient/redemption-requests لجلب الطلبات المعلقة",
        "تمت إضافة نقطة النهاية /api/recipient/redemption-requests/<id>/respond لإجراءات الموافقة/الرفض",
        "تم تنفيذ حدث Socket.IO في الوقت الحقيقي 'redemption_request' لإخطار المستلمين فورًا",
        "تم إنشاء نافذة موافقة استرداد جميلة في RecipientDashboard تحتوي على تفاصيل المتجر، المبلغ، ومعلومات الرصيد",
        "تمت إضافة أزرار approve/reject مع حقل إدخال السبب لعمليات الرفض",
        "تمت إضافة مؤقت انتهاء تلقائي (5 دقائق) للطلبات المعلقة",
        "يمكن للمستلمين رؤية الوقت المتبقي لكل طلب",
        "يتلقى البائع إشعارًا في الوقت الفعلي عندما يوافق المستلم أو يرفض",
        "تم تحديث رسالة النجاح في VendorDashboard لتشير إلى \"تم إرسال الطلب\" بدلاً من \"تم الاسترداد\"",
        "تمت إضافة عداد طلبات الاسترداد المعلقة في RecipientDashboard",
        "تم تنفيذ نظام قائمة انتظار لطلبات الاسترداد المتعددة المتزامنة",
        "تمت إضافة سكريبت ترحيل قاعدة البيانات لجدول RedemptionRequest"
      ],
      "impact_ar": "تم معالجة ملاحظات المستخدمين الحرجة: (1) يمكن لأصحاب المتاجر الآن استرداد مبلغ الشراء الفعلي فقط بدلاً من قيمة القسيمة الكاملة، (2) يمتلك المستلمون السيطرة الكاملة ويجب عليهم الموافقة على كل عملية استرداد، (3) يمنع الاستردادات غير المصرح بها للقسائم الكاملة. هذا يغير بشكل جذري سير عمل الاسترداد ليكون مركزًا حول المستلم وآمنًا.",
      "affectedComponents_ar": "backend/models.py - تم إضافة نموذج RedemptionRequest  \nbackend/app.py - تم تعديل نقاط نهاية redemption وإضافة نقاط نهاية approval  \nfrontend/src/App.jsx - واجهة مستخدم الموافقة على redemption في RecipientDashboard  \nfrontend/src/App.jsx - إدخال المبلغ الجزئي في VendorDashboard  \nSocket.IO - تم إضافة أحداث redemption_request و redemption_response",
      "title_pl": "Dwustopniowy proces realizacji vouchera z zatwierdzeniem odbiorcy",
      "description_pl": "Całkowity redesign systemu voucher redemption oparty na kluczowych opiniach użytkowników – właściciele sklepów mogą teraz żądać częściowych realizacji, a odbiorcy muszą zatwierdzać każde żądanie realizacji w czasie rzeczywistym.",
      "details_pl": [
        "Dodano model bazy danych RedemptionRequest do śledzenia oczekujących żądań realizacji",
        "Właściciele sklepów mogą teraz wprowadzać niestandardową kwotę realizacji (obsługa częściowej realizacji)",
        "Zmodyfikowano endpoint /vendor/redeem-voucher, aby tworzył żądania oczekujące zamiast natychmiastowego realizowania voucherów",
        "Dodano endpoint /api/recipient/redemption-requests do pobierania oczekujących żądań",
        "Dodano endpoint /api/recipient/redemption-requests/<id>/respond do akcji zatwierdzania/odrzucania",
        "Wdrożono zdarzenie Socket.IO w czasie rzeczywistym 'redemption_request' do natychmiastowego powiadamiania odbiorców",
        "Utworzono estetyczne okno modalne zatwierdzania realizacji w RecipientDashboard z danymi sklepu, kwotą oraz informacjami o saldzie",
        "Dodano przyciski approve/reject z polem na podanie powodu odrzucenia",
        "Dodano automatyczny timer wygasania (5 minut) dla oczekujących żądań",
        "Odbiorcy mogą zobaczyć pozostały czas dla każdego żądania",
        "Dostawca otrzymuje powiadomienie w czasie rzeczywistym, gdy odbiorca zatwierdzi lub odrzuci",
        "Zaktualizowano komunikat sukcesu w VendorDashboard, aby wskazywał \"request sent\" zamiast \"redeemed\"",
        "Dodano licznik oczekujących żądań realizacji w RecipientDashboard",
        "Wdrożono system kolejkowania dla wielu jednoczesnych żądań realizacji",
        "Dodano skrypt migracji bazy danych dla tabeli RedemptionRequest"
      ],
      "impact_pl": "KRYTYCZNE OPINIE UŻYTKOWNIKÓW ROZWIĄZANE: (1) Właściciele sklepów mogą teraz realizować tylko rzeczywistą kwotę zakupu zamiast pełnej wartości vouchera, (2) Odbiorcy mają pełną kontrolę i muszą zatwierdzić każdą realizację, (3) Zapobiega nieautoryzowanym realizacjom pełnych voucherów. To zasadniczo zmienia proces realizacji na odbiorcę zorientowany i bezpieczny.",
      "affectedComponents_pl": "backend/models.py - Dodano model RedemptionRequest, backend/app.py - Zmodyfikowano redemption endpoints i dodano approval endpoints, frontend/src/App.jsx - UI zatwierdzania redemption w RecipientDashboard, frontend/src/App.jsx - Częściowe wprowadzanie kwoty w VendorDashboard, Socket.IO - Dodano zdarzenia redemption_request i redemption_response",
      "title_ro": "Flux de lucru în 2 pași pentru răscumpărarea voucherelor cu aprobare de la destinatar",
      "description_ro": "Redesign complet al sistemului de răscumpărare a voucherelor bazat pe feedback critic de la utilizatori - proprietarii de magazine pot acum solicita răscumpărări parțiale, iar destinatarii trebuie să aprobe fiecare cerere de răscumpărare în timp real",
      "impact_ro": "FEEDBACK CRITIC DE LA UTILIZATORI ADRESAT: (1) Proprietarii de magazine pot răscumpăra acum doar suma efectivă a achiziției în loc de întregul voucher, (2) Destinatarii au control total și trebuie să aprobe fiecare răscumpărare, (3) Previne răscumpărările neautorizate ale întregului voucher. Aceasta schimbă fundamental fluxul de lucru al răscumpărării pentru a fi centrat pe destinatar și sigur.",
      "details_ro": [
        "Adăugat modelul de bază de date RedemptionRequest pentru a urmări cererile de răscumpărare în așteptare",
        "Proprietarii de magazine pot introduce acum suma personalizată pentru răscumpărare (suport pentru răscumpărare parțială)",
        "Modificat endpoint-ul /vendor/redeem-voucher pentru a crea cereri în așteptare în loc de răscumpărare imediată",
        "Adăugat endpoint-ul /api/recipient/redemption-requests pentru a prelua cererile în așteptare",
        "Adăugat endpoint-ul /api/recipient/redemption-requests/<id>/respond pentru acțiuni de aprobare/respingere",
        "Implementat evenimentul în timp real Socket.IO 'redemption_request' pentru a notifica destinatarii instantaneu",
        "Creat modal frumos pentru aprobarea răscumpărării în RecipientDashboard cu detalii despre magazin, sumă și informații despre sold",
        "Adăugate butoane de aprobare/respingere cu câmp pentru motiv în cazul respingerilor",
        "Adăugat temporizator de expirare automată (5 minute) pentru cererile în așteptare",
        "Destinatarii pot vedea timpul rămas pentru fiecare cerere",
        "Vendorul primește notificare în timp real când destinatarul aprobă/respinge",
        "Actualizat mesajul de succes din VendorDashboard pentru a indica 'cerere trimisă' în loc de 'răscumpărat'",
        "Adăugat contor pentru cererile de răscumpărare în așteptare în RecipientDashboard",
        "Implementat sistem de coadă pentru cereri multiple simultane de răscumpărare",
        "Adăugat script de migrare a bazei de date pentru tabela RedemptionRequest"
      ],
      "affectedComponents_ro": "backend/models.py - Adăugat modelul RedemptionRequest, backend/app.py - Modificat endpoint-urile de răscumpărare și adăugat endpoint-urile de aprobare, frontend/src/App.jsx - UI pentru aprobarea răscumpărării în RecipientDashboard, frontend/src/App.jsx - Input pentru suma parțială în VendorDashboard, Socket.IO - Adăugate evenimentele redemption_request și redemption_response"
    },
    {
      "id": 28,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "Bug Fix",
      "priority": "High",
      "title": "Fixed Alert and Prompt Messages Translation",
      "description": "Fixed hardcoded English alert and prompt messages to use translation keys, ensuring they display in user's selected language",
      "details": [
        "Added 15 new translation keys for alert messages (success/error notifications)",
        "Added 2 new translation keys for prompt messages (admin notes, rejection reason)",
        "Replaced all hardcoded English alert() calls with t('alerts.*') translation keys",
        "Replaced all hardcoded English prompt() calls with t('prompts.*') translation keys",
        "Added Arabic translations for all alert and prompt messages",
        "Alerts now display: 'تم تحديث المدرسة بنجاح' instead of 'School updated successfully' in Arabic",
        "Prompts now display: 'ملاحظات المسؤول (اختياري):' instead of 'Admin notes (optional):' in Arabic"
      ],
      "impact": "All system notifications and prompts now display in user's selected language. No more English-only alert messages when using Arabic, Polish, or Romanian.",
      "affectedComponents": [
        "App.jsx - All alert() and prompt() calls",
        "en.json - Added alerts and prompts sections",
        "ar.json - Added alerts and prompts sections"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.3",
      "title_ar": "تم إصلاح ترجمة رسائل Alert و Prompt",
      "description_ar": "تم إصلاح رسائل التنبيه والإشعارات المكتوبة باللغة الإنجليزية بشكل ثابت لاستخدام مفاتيح الترجمة، مما يضمن عرضها بلغة المستخدم المختارة",
      "details_ar": [
        "تمت إضافة 15 مفتاح ترجمة جديد لرسائل التنبيه (إشعارات النجاح/الخطأ)",
        "تمت إضافة مفتاحي ترجمة جديدين لرسائل prompt (ملاحظات المسؤول، سبب الرفض)",
        "تم استبدال جميع استدعاءات alert() المكتوبة باللغة الإنجليزية بشكل ثابت بمفاتيح الترجمة t('alerts.*')",
        "تم استبدال جميع استدعاءات prompt() المكتوبة باللغة الإنجليزية بشكل ثابت بمفاتيح الترجمة t('prompts.*')",
        "تمت إضافة الترجمات العربية لجميع رسائل التنبيه والمطالبات",
        "التنبيهات الآن تعرض: 'تم تحديث المدرسة بنجاح' بدلاً من 'School updated successfully' باللغة العربية",
        "تعرض Prompts الآن: 'ملاحظات المسؤول (اختياري):' بدلاً من 'Admin notes (optional):' باللغة العربية"
      ],
      "impact_ar": "جميع إشعارات النظام والتنبيهات الآن تُعرض باللغة التي يختارها المستخدم. لم تعد هناك رسائل تنبيه باللغة الإنجليزية فقط عند استخدام اللغة العربية أو البولندية أو الرومانية.",
      "affectedComponents_ar": "App.jsx - جميع استدعاءات alert() و prompt()، en.json - تمت إضافة أقسام التنبيهات والتنبيهات التفاعلية، ar.json - تمت إضافة أقسام التنبيهات والتنبيهات التفاعلية",
      "title_pl": "Naprawiono tłumaczenie komunikatów Alert i Prompt",
      "description_pl": "Naprawiono twardo zakodowane angielskie komunikaty alert i prompt, aby używały kluczy tłumaczeń, zapewniając wyświetlanie w wybranym przez użytkownika języku",
      "details_pl": [
        "Dodano 15 nowych kluczy tłumaczeń dla komunikatów alertów (powiadomienia o sukcesie/błędzie)",
        "Dodano 2 nowe klucze tłumaczeń dla komunikatów prompt (admin notes, rejection reason)",
        "Zamieniono wszystkie na stałe zakodowane wywołania alert() w języku angielskim na klucze tłumaczeń t('alerts.*')",
        "Zamieniono wszystkie na stałe zakodowane wywołania prompt() w języku angielskim na klucze tłumaczeń t('prompts.*')",
        "Dodano tłumaczenia na arabski dla wszystkich komunikatów alert i prompt",
        "Alerty teraz wyświetlają: 'تم تحديث المدرسة بنجاح' zamiast 'School updated successfully' w języku arabskim",
        "Podpowiedzi teraz wyświetlają: 'ملاحظات المسؤول (اختياري):' zamiast 'Admin notes (optional):' w języku arabskim"
      ],
      "impact_pl": "Wszystkie powiadomienia systemowe i komunikaty wyświetlają się teraz w wybranym przez użytkownika języku. Koniec z komunikatami ostrzegawczymi wyłącznie w języku angielskim podczas korzystania z języka arabskiego, polskiego czy rumuńskiego.",
      "affectedComponents_pl": "App.jsx - Wszystkie wywołania alert() i prompt(), en.json - Dodano sekcje alerts i prompts, ar.json - Dodano sekcje alerts i prompts",
      "title_ro": "Mesaje de alertă și prompt fixate pentru traducere",
      "description_ro": "Mesaje de alertă și prompt în limba engleză hardcodate fixate pentru a folosi chei de traducere, asigurând afișarea în limba selectată de utilizator",
      "impact_ro": "Toate notificările și prompturile sistemului se afișează acum în limba selectată de utilizator. Nu mai există mesaje de alertă doar în engleză când se folosește araba, poloneza sau româna.",
      "details_ro": [
        "Adăugate 15 chei noi de traducere pentru mesaje de alertă (notificări de succes/eroare)",
        "Adăugate 2 chei noi de traducere pentru mesaje de prompt (note admin, motivul respingerii)",
        "Înlocuite toate apelurile hardcodate în engleză alert() cu chei de traducere t('alerts.*')",
        "Înlocuite toate apelurile hardcodate în engleză prompt() cu chei de traducere t('prompts.*')",
        "Adăugate traduceri în arabă pentru toate mesajele de alertă și prompt",
        "Alerta afișează acum: 'تم تحديث المدرسة بنجاح' în loc de 'School updated successfully' în arabă",
        "Promptul afișează acum: 'ملاحظات المسؤول (اختياري):' în loc de 'Admin notes (optional):' în arabă"
      ],
      "affectedComponents_ro": "App.jsx - Toate apelurile alert() și prompt(), en.json - Secțiuni adăugate pentru alerts și prompts, ar.json - Secțiuni adăugate pentru alerts și prompts"
    },
    {
      "id": 27,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "Bug Fix",
      "priority": "High",
      "title": "Language Persistence and Auto-Reload on Language Change",
      "description": "Fixed language preference persistence and added automatic page reload when users change language to ensure all data labels are displayed in the selected language",
      "details": [
        "Language preference already stored in localStorage via i18next-browser-languagedetector",
        "Added window.location.reload() when language changes to refresh all data with new translations",
        "Updated AdminDashboard language selector to reload page on change",
        "Updated SchoolDashboard language selector to reload page on change",
        "Ensures all database content labels (Address, Phone, Email, etc.) display in selected language",
        "Language selection now persists across browser sessions",
        "Users see immediate translation updates when switching languages"
      ],
      "impact": "Users can now switch languages and immediately see all UI labels and data labels translated. Language preference is saved and automatically applied on next visit.",
      "affectedComponents": [
        "App.jsx - AdminDashboard language selector",
        "App.jsx - SchoolDashboard language selector",
        "i18n.js - Language detection configuration"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.3",
      "title_ar": "الاحتفاظ باللغة وإعادة التحميل التلقائي عند تغيير اللغة",
      "description_ar": "تم إصلاح استمرار تفضيل اللغة وإضافة إعادة تحميل الصفحة تلقائيًا عند تغيير المستخدمين للغة لضمان عرض جميع تسميات البيانات باللغة المختارة",
      "details_ar": [
        "تفضيل اللغة مخزن بالفعل في localStorage عبر i18next-browser-languagedetector",
        "تمت إضافة window.location.reload() عند تغيير اللغة لتحديث جميع البيانات مع الترجمات الجديدة",
        "تم تحديث محدد اللغة في AdminDashboard لإعادة تحميل الصفحة عند التغيير",
        "تم تحديث محدد اللغة في SchoolDashboard لإعادة تحميل الصفحة عند التغيير",
        "يضمن عرض جميع تسميات محتوى قاعدة البيانات (Address, Phone, Email، إلخ) باللغة المختارة",
        "يتم الآن حفظ اختيار اللغة عبر جلسات المتصفح المتعددة",
        "يرى المستخدمون تحديثات الترجمة الفورية عند التبديل بين اللغات"
      ],
      "impact_ar": "يمكن للمستخدمين الآن تبديل اللغات ورؤية جميع تسميات واجهة المستخدم وتسميات البيانات مترجمة على الفور. يتم حفظ تفضيل اللغة وتطبيقه تلقائيًا عند الزيارة التالية.",
      "affectedComponents_ar": "App.jsx - محدد اللغة في AdminDashboard، App.jsx - محدد اللغة في SchoolDashboard، i18n.js - تكوين اكتشاف اللغة",
      "title_pl": "Utrzymanie Wybranego Języka i Automatyczne Przeładowanie przy Zmianie Języka",
      "description_pl": "Naprawiono zachowanie preferencji językowej oraz dodano automatyczne przeładowanie strony po zmianie języka przez użytkowników, aby zapewnić wyświetlanie wszystkich etykiet danych w wybranym języku.",
      "details_pl": [
        "Preferencje językowe już zapisane w localStorage za pomocą i18next-browser-languagedetector",
        "Dodano window.location.reload() przy zmianie języka, aby odświeżyć wszystkie dane z nowymi tłumaczeniami.",
        "Zaktualizowano selektor języka w AdminDashboard, aby przeładowywał stronę po zmianie",
        "Zaktualizowano selektor języka w SchoolDashboard, aby przeładowywał stronę po zmianie",
        "Zapewnia wyświetlanie wszystkich etykiet zawartości bazy danych (Address, Phone, Email itp.) w wybranym języku",
        "Wybór języka jest teraz zapamiętywany między sesjami przeglądarki",
        "Użytkownicy widzą natychmiastowe aktualizacje tłumaczeń podczas zmiany języków"
      ],
      "impact_pl": "Użytkownicy mogą teraz zmieniać języki i od razu zobaczyć wszystkie etykiety UI oraz etykiety danych przetłumaczone. Preferencje językowe są zapisywane i automatycznie stosowane przy kolejnej wizycie.",
      "affectedComponents_pl": "App.jsx - selektor języka w AdminDashboard, App.jsx - selektor języka w SchoolDashboard, i18n.js - konfiguracja wykrywania języka",
      "title_ro": "Persistența limbii și reîncărcarea automată la schimbarea limbii",
      "description_ro": "S-a remediat persistența preferinței limbii și s-a adăugat reîncărcarea automată a paginii când utilizatorii schimbă limba pentru a asigura afișarea tuturor etichetelor de date în limba selectată",
      "impact_ro": "Utilizatorii pot acum să schimbe limbile și să vadă imediat toate etichetele UI și etichetele de date traduse. Preferința limbii este salvată și aplicată automat la următoarea vizită.",
      "details_ro": [
        "Preferința limbii este deja stocată în localStorage prin i18next-browser-languagedetector",
        "S-a adăugat window.location.reload() când limba se schimbă pentru a reîmprospăta toate datele cu noile traduceri",
        "Selectorul de limbă din AdminDashboard a fost actualizat pentru a reîncărca pagina la schimbare",
        "Selectorul de limbă din SchoolDashboard a fost actualizat pentru a reîncărca pagina la schimbare",
        "Asigură afișarea tuturor etichetelor de conținut din baza de date (Address, Phone, Email etc.) în limba selectată",
        "Selecția limbii persistă acum între sesiunile browserului",
        "Utilizatorii văd actualizările de traducere imediat când schimbă limbile"
      ],
      "affectedComponents_ro": "App.jsx - AdminDashboard language selector, App.jsx - SchoolDashboard language selector, i18n.js - Language detection configuration"
    },
    {
      "id": 26,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "Internationalization",
      "priority": "High",
      "title": "Analytics Dashboard Complete i18n Coverage",
      "description": "Translated all analytics dashboard elements including metrics, statistics, and chart labels to support full multilingual experience",
      "details": [
        "Added translation keys: systemAnalyticsDashboard, systemOverview, marketplaceStatistics, redemptionRate, activeVouchers, totalVouchers, totalUsers, redeemed, totalValue",
        "Translated dashboard title: System Analytics Dashboard → لوحة تحليلات النظام",
        "Translated metric cards: Total Users, Total Vouchers, Active Vouchers, Redemption Rate",
        "Translated System Overview section: Recipients, Vendors, Schools, VCFSE Organizations",
        "Translated Marketplace Statistics: Active Shops, Total Items, Available Items, Claimed Items",
        "Translated Refresh button and all data labels",
        "Added Arabic translations for all analytics terms",
        "Ensured consistent translation across English, Arabic, Polish, and Romanian"
      ],
      "impact": "Analytics dashboard now fully supports multilingual display. Arabic, Polish, and Romanian speakers can view all system statistics and metrics in their language.",
      "affectedComponents": [
        "AnalyticsDashboard.jsx",
        "locales/en.json",
        "locales/ar.json"
      ],
      "userTypes": [
        "admin"
      ],
      "version": "1.0.3",
      "title_ar": "لوحة تحليلات Analytics Dashboard تغطي i18n بشكل كامل",
      "description_ar": "تمت ترجمة جميع عناصر لوحة تحكم التحليلات بما في ذلك المقاييس والإحصائيات وتسميات المخططات لدعم تجربة متعددة اللغات كاملة",
      "details_ar": [
        "تمت إضافة مفاتيح الترجمة: systemAnalyticsDashboard، systemOverview، marketplaceStatistics، redemptionRate، activeVouchers، totalVouchers، totalUsers، redeemed، totalValue",
        "Translated dashboard title: System Analytics Dashboard → لوحة تحليلات النظام",
        "بطاقات المقاييس المترجمة: Total Users، Total Vouchers، Active Vouchers، Redemption Rate",
        "نظرة عامة على النظام المترجم: Recipients، Vendors، Schools، VCFSE Organizations",
        "إحصائيات السوق المترجمة: Active Shops، Total Items، Available Items، Claimed Items",
        "تمت ترجمة زر Refresh وجميع تسميات البيانات",
        "تمت إضافة الترجمات العربية لجميع مصطلحات analytics",
        "تم ضمان الترجمة المتسقة عبر English و Arabic و Polish و Romanian"
      ],
      "impact_ar": "لوحة تحليلات Analytics تدعم الآن العرض متعدد اللغات بشكل كامل. يمكن للمتحدثين بالعربية، البولندية، والرومانية عرض جميع إحصائيات النظام ومقاييسه بلغتهم.",
      "affectedComponents_ar": "AnalyticsDashboard.jsx، locales/en.json، locales/ar.json",
      "title_pl": "Kompleksowe wsparcie i18n dla Analytics Dashboard",
      "description_pl": "Przetłumaczono wszystkie elementy panelu analitycznego, w tym metryki, statystyki oraz etykiety wykresów, aby zapewnić pełne wsparcie dla doświadczenia wielojęzycznego.",
      "details_pl": [
        "Dodano klucze tłumaczeń: systemAnalyticsDashboard, systemOverview, marketplaceStatistics, redemptionRate, activeVouchers, totalVouchers, totalUsers, redeemed, totalValue",
        "Przetłumaczony tytuł dashboardu: System Analytics Dashboard → لوحة تحليلات النظام",
        "Przetłumaczone karty metryk: Total Users, Total Vouchers, Active Vouchers, Redemption Rate",
        "Przetłumaczona sekcja Przegląd systemu: Recipients, Vendors, Schools, VCFSE Organizations",
        "Przetłumaczone statystyki Marketplace: Active Shops, Total Items, Available Items, Claimed Items",
        "Przetłumaczono przycisk Refresh oraz wszystkie etykiety danych",
        "Dodano tłumaczenia na język arabski dla wszystkich terminów związanych z analytics",
        "Zapewniono spójną translację w językach English, Arabic, Polish oraz Romanian"
      ],
      "impact_pl": "Panel analityczny w pełni obsługuje teraz wyświetlanie wielojęzyczne. Użytkownicy mówiący po arabsku, polsku i rumuńsku mogą przeglądać wszystkie statystyki i metryki systemu w swoim języku.",
      "affectedComponents_pl": "AnalyticsDashboard.jsx, locales/en.json, locales/ar.json",
      "title_ro": "Acoperire completă i18n pentru Analytics Dashboard",
      "description_ro": "Au fost traduse toate elementele din analytics dashboard, inclusiv metrici, statistici și etichetele graficelor pentru a susține o experiență complet multilingvă",
      "impact_ro": "Analytics dashboard suportă acum afișarea complet multilingvă. Vorbitorii de arabă, poloneză și română pot vizualiza toate statisticile și metricile sistemului în limba lor.",
      "details_ro": [
        "Chei de traducere adăugate: systemAnalyticsDashboard, systemOverview, marketplaceStatistics, redemptionRate, activeVouchers, totalVouchers, totalUsers, redeemed, totalValue",
        "Titlul dashboard-ului tradus: System Analytics Dashboard → لوحة تحليلات النظام",
        "Cardurile de metrici traduse: Total Users, Total Vouchers, Active Vouchers, Redemption Rate",
        "Secțiunea System Overview tradusă: Recipients, Vendors, Schools, VCFSE Organizations",
        "Marketplace Statistics traduse: Active Shops, Total Items, Available Items, Claimed Items",
        "Butonul Refresh și toate etichetele de date traduse",
        "Traduceri în arabă adăugate pentru toți termenii de analytics",
        "S-a asigurat traducerea consistentă în engleză, arabă, poloneză și română"
      ],
      "affectedComponents_ro": "AnalyticsDashboard.jsx, locales/en.json, locales/ar.json"
    },
    {
      "id": 25,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "Internationalization",
      "priority": "High",
      "title": "Comprehensive i18n Coverage for Data UI Elements",
      "description": "Applied translations to all data-related UI elements including table headers, form labels, status labels, and action buttons across all dashboards",
      "details": [
        "Added translation keys: address, phone, shopOwner, foodToGoItems, view, actions, status, name, organization, date, amount, description, category, quantity, price, total",
        "Updated shop/vendor cards to use t() for all labels (Address, Phone, Email, Shop Owner, Food to Go Items)",
        "Updated school/organization cards to use t() for all labels",
        "Updated form labels in edit modals to use translations",
        "Updated payout and voucher display labels",
        "Applied translations to all Edit and Delete buttons",
        "Added Arabic translations: العنوان, الهاتف, صاحب المتجر, عناصر الطعام للذهاب",
        "Ensured consistent translation coverage across English, Arabic, Polish, and Romanian"
      ],
      "impact": "Arabic, Polish, and Romanian speakers now see fully translated data displays and forms, not just navigation. This provides a truly localized experience for non-English users.",
      "affectedComponents": [
        "App.jsx - AdminDashboard Shop Cards",
        "App.jsx - AdminDashboard School Cards",
        "App.jsx - Edit Forms",
        "App.jsx - VCSEDashboard Data Displays",
        "App.jsx - VendorDashboard Payout Displays",
        "locales/en.json",
        "locales/ar.json"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.3",
      "title_ar": "تغطية شاملة لـ i18n لعناصر واجهة المستخدم الخاصة بالبيانات",
      "description_ar": "تم تطبيق الترجمات على جميع عناصر واجهة المستخدم المتعلقة بالبيانات بما في ذلك رؤوس الجداول، تسميات النماذج، تسميات الحالة، وأزرار الإجراءات عبر جميع لوحات المعلومات",
      "details_ar": [
        "تمت إضافة مفاتيح الترجمة: address, phone, shopOwner, foodToGoItems, view, actions, status, name, organization, date, amount, description, category, quantity, price, total",
        "تم تحديث بطاقات المتجر/البائع لاستخدام t() لجميع التسميات (Address, Phone, Email, Shop Owner, Food to Go Items)",
        "تم تحديث بطاقات المدارس/المنظمات لاستخدام t() لجميع التسميات",
        "تم تحديث تسميات النماذج في نوافذ التعديل لاستخدام الترجمات",
        "تم تحديث تسميات عرض payout و voucher",
        "تم تطبيق الترجمات على جميع أزرار Edit و Delete",
        "تمت إضافة الترجمات العربية: العنوان, الهاتف, صاحب المتجر, عناصر الطعام للذهاب",
        "تم ضمان تغطية ترجمة متسقة عبر English و Arabic و Polish و Romanian"
      ],
      "impact_ar": "المتحدثون بالعربية والبولندية والرومانية يرون الآن عروض البيانات والنماذج مترجمة بالكامل، وليس فقط التنقل. هذا يوفر تجربة محلية حقيقية للمستخدمين غير الناطقين بالإنجليزية.",
      "affectedComponents_ar": "App.jsx - بطاقات متجر AdminDashboard، App.jsx - بطاقات مدرسة AdminDashboard، App.jsx - نماذج التعديل، App.jsx - عروض بيانات VCSEDashboard، App.jsx - عروض مدفوعات VendorDashboard، locales/en.json، locales/ar.json",
      "title_pl": "Kompleksowe wsparcie i18n dla elementów UI danych",
      "description_pl": "Zastosowano tłumaczenia do wszystkich elementów UI związanych z danymi, w tym nagłówków tabel, etykiet formularzy, etykiet statusu oraz przycisków akcji we wszystkich dashboardach.",
      "details_pl": [
        "Dodano klucze tłumaczeń: address, phone, shopOwner, foodToGoItems, view, actions, status, name, organization, date, amount, description, category, quantity, price, total",
        "Zaktualizowano karty shop/vendor, aby używały t() dla wszystkich etykiet (Address, Phone, Email, Shop Owner, Food to Go Items)",
        "Zaktualizowano karty szkoły/organizacji, aby używały t() dla wszystkich etykiet",
        "Zaktualizowano etykiety formularzy w oknach edycji, aby korzystały z tłumaczeń",
        "Zaktualizowano etykiety wyświetlania payout i voucher",
        "Zastosowano tłumaczenia do wszystkich przycisków Edit i Delete",
        "Dodano tłumaczenia na arabski: العنوان, الهاتف, صاحب المتجر, عناصر الطعام للذهاب",
        "Zapewniono spójne pokrycie tłumaczeń w językach English, Arabic, Polish oraz Romanian"
      ],
      "impact_pl": "Użytkownicy mówiący po arabsku, polsku i rumuńsku widzą teraz w pełni przetłumaczone wyświetlacze danych i formularze, a nie tylko nawigację. Zapewnia to prawdziwie zlokalizowane doświadczenie dla użytkowników nieanglojęzycznych.",
      "affectedComponents_pl": "App.jsx - AdminDashboard Shop Cards, App.jsx - AdminDashboard School Cards, App.jsx - Edit Forms, App.jsx - VCSEDashboard Data Displays, App.jsx - VendorDashboard Payout Displays, locales/en.json, locales/ar.json",
      "title_ro": "Acoperire i18n cuprinzătoare pentru elementele UI de date",
      "description_ro": "S-au aplicat traduceri pentru toate elementele UI legate de date, inclusiv antetele tabelelor, etichetele formularelor, etichetele de stare și butoanele de acțiune pe toate dashboard-urile",
      "impact_ro": "Vorbititorii de arabă, poloneză și română văd acum afișaje și formulare de date complet traduse, nu doar navigarea. Aceasta oferă o experiență cu adevărat localizată pentru utilizatorii non-englezi.",
      "details_ro": [
        "Chei de traducere adăugate: address, phone, shopOwner, foodToGoItems, view, actions, status, name, organization, date, amount, description, category, quantity, price, total",
        "Cardurile shop/vendor actualizate pentru a folosi t() pentru toate etichetele (Address, Phone, Email, Shop Owner, Food to Go Items)",
        "Cardurile school/organization actualizate pentru a folosi t() pentru toate etichetele",
        "Etichetele formularelor din modalele de editare actualizate pentru a folosi traduceri",
        "Etichetele de afișare pentru payout și voucher actualizate",
        "S-au aplicat traduceri pentru toate butoanele Edit și Delete",
        "Traduceri arabe adăugate: العنوان, الهاتف, صاحب المتجر, عناصر الطعام للذهاب",
        "S-a asigurat o acoperire consistentă a traducerilor pentru engleză, arabă, poloneză și română"
      ],
      "affectedComponents_ro": "App.jsx - AdminDashboard Shop Cards, App.jsx - AdminDashboard School Cards, App.jsx - Edit Forms, App.jsx - VCSEDashboard Data Displays, App.jsx - VendorDashboard Payout Displays, locales/en.json, locales/ar.json"
    },
    {
      "id": 24,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "UI Enhancement",
      "priority": "High",
      "title": "Multi-Step Registration Form with Modern Design",
      "description": "Transformed registration page into a beautiful 3-step multi-stepper form with green gradient theme for brand uniformity",
      "details": [
        "Replaced long single-page form with 3-step wizard: Account Type, Personal Info, Address Details",
        "Added visual step indicators with icons and progress tracking",
        "Implemented Previous/Next navigation buttons for better UX",
        "Applied green gradient theme (linear-gradient(135deg, #4CAF50 0%, #45a049 100%)) for brand consistency",
        "Removed ticket emoji, replaced with 'BAK UP' text branding",
        "Created split-screen design with branding/stats on left side",
        "Added step-by-step validation to catch errors early",
        "Enhanced input fields with focus effects and modern styling",
        "Improved form layout with better spacing and typography",
        "Added smooth transitions and hover animations",
        "Responsive design adapts to mobile and desktop screens"
      ],
      "impact": "Significantly improved registration experience - less overwhelming, more intuitive, and visually appealing with consistent green branding. Reduces form abandonment and increases successful registrations.",
      "affectedComponents": [
        "App.jsx - RegisterPage component"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.3",
      "title_ar": "نموذج تسجيل متعدد الخطوات بتصميم حديث",
      "description_ar": "تم تحويل صفحة التسجيل إلى نموذج متعدد الخطوات مكون من 3 خطوات بتصميم جميل مع تدرج لوني أخضر لضمان توحيد العلامة التجارية",
      "details_ar": [
        "تم استبدال النموذج الطويل في صفحة واحدة بساحر من 3 خطوات: Account Type، Personal Info، Address Details",
        "تمت إضافة مؤشرات خطوات بصرية مع أيقونات وتتبع التقدم",
        "تم تنفيذ أزرار التنقل Previous/Next لتحسين تجربة المستخدم (UX)",
        "تم تطبيق سمة التدرج الأخضر (linear-gradient(135deg, #4CAF50 0%, #45a049 100%)) لضمان اتساق العلامة التجارية",
        "تم إزالة رمز التذكرة (ticket emoji)، واستبداله بعلامة نصية 'BAK UP'",
        "تم إنشاء تصميم الشاشة المقسمة مع العلامة التجارية والإحصائيات على الجانب الأيسر",
        "تمت إضافة التحقق خطوة بخطوة لاكتشاف الأخطاء مبكرًا",
        "تم تحسين حقول الإدخال بتأثيرات التركيز وتصميم عصري",
        "تحسين تخطيط النموذج مع تباعد وطباعة أفضل",
        "تمت إضافة انتقالات سلسة ورسوم متحركة عند التمرير بالماوس",
        "تصميم Responsive يتكيف مع شاشات الهواتف المحمولة وأجهزة الكمبيوتر المكتبية"
      ],
      "impact_ar": "تحسين كبير في تجربة التسجيل - أقل إرباكًا، أكثر سهولة في الاستخدام، وجذاب بصريًا مع توحيد العلامة التجارية باللون الأخضر. يقلل من ترك النماذج ويزيد من التسجيلات الناجحة.",
      "affectedComponents_ar": "App.jsx - مكون RegisterPage",
      "title_pl": "Wieloetapowy formularz rejestracyjny z nowoczesnym designem",
      "description_pl": "Przekształcono stronę rejestracji w piękny, 3-etapowy formularz multi-stepper z zielonym gradientem dla spójności marki",
      "impact_pl": "Znacząco poprawiono doświadczenie rejestracji – mniej przytłaczające, bardziej intuicyjne i wizualnie atrakcyjne z jednolitym zielonym brandingiem. Zmniejsza porzucanie formularza i zwiększa liczbę pomyślnych rejestracji.",
      "details_pl": [
        "Zastąpiono długi formularz jednokartkowy 3-etapowym kreatorem: Account Type, Personal Info, Address Details",
        "Dodano wizualne wskaźniki kroków z ikonami i śledzeniem postępu",
        "Wdrożono przyciski Previous/Next dla lepszego UX",
        "Zastosowano zielony gradient (linear-gradient(135deg, #4CAF50 0%, #45a049 100%)) dla spójności marki",
        "Usunięto emoji biletu, zastąpiono tekstem brandingowym 'BAK UP'",
        "Stworzono projekt split-screen z brandingiem/statystykami po lewej stronie",
        "Dodano walidację krok po kroku, aby wykrywać błędy wcześniej",
        "Ulepszono pola input z efektami focus i nowoczesnym stylem",
        "Poprawiono układ formularza z lepszym odstępem i typografią",
        "Dodano płynne przejścia i animacje hover",
        "Responsywny design dostosowujący się do ekranów mobilnych i desktopowych"
      ],
      "affectedComponents_pl": "App.jsx - komponent RegisterPage",
      "title_ro": "Formular de înregistrare în mai mulți pași cu design modern",
      "description_ro": "Pagina de înregistrare a fost transformată într-un formular frumos cu 3 pași multi-stepper, cu temă de gradient verde pentru uniformitatea brandului",
      "impact_ro": "Experiența de înregistrare a fost semnificativ îmbunătățită - mai puțin copleșitoare, mai intuitivă și atrăgătoare vizual, cu branding verde consistent. Reduce abandonul formularului și crește înregistrările reușite.",
      "details_ro": [
        "Formularul lung de o singură pagină a fost înlocuit cu un wizard în 3 pași: Account Type, Personal Info, Address Details",
        "Au fost adăugate indicatori vizuali de pași cu icoane și urmărirea progresului",
        "Au fost implementate butoane de navigare Previous/Next pentru o experiență UX mai bună",
        "A fost aplicată tema de gradient verde (linear-gradient(135deg, #4CAF50 0%, #45a049 100%)) pentru consistența brandului",
        "Emoji-ul de bilet a fost eliminat, înlocuit cu branding text 'BAK UP'",
        "A fost creat un design split-screen cu branding/statistici pe partea stângă",
        "A fost adăugată validarea pas cu pas pentru a detecta erorile din timp",
        "Au fost îmbunătățite câmpurile de input cu efecte de focus și stilizare modernă",
        "Layout-ul formularului a fost îmbunătățit cu spațiere și tipografie mai bune",
        "Au fost adăugate tranziții line și animații la hover",
        "Designul responsive se adaptează la ecrane mobile și desktop"
      ],
      "affectedComponents_ro": "App.jsx - componenta RegisterPage"
    },
    {
      "id": 23,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "Feature",
      "priority": "High",
      "title": "Voucher Unassign Feature - Return Funds to Wallet",
      "description": "Added ability for VCSE and School users to unassign active vouchers and return funds to their wallet",
      "details": [
        "Added 'Unassign' button (❌) next to 'Reassign' button in Voucher Orders",
        "Unassign button only appears for active vouchers",
        "Confirmation dialog warns user about consequences before unassigning",
        "Backend API endpoint /api/voucher/unassign created",
        "Funds automatically returned to organization wallet upon unassignment",
        "Voucher status changed to 'cancelled' with reason tracked",
        "Wallet transaction created with type 'credit' for audit trail",
        "Permission checks ensure only voucher issuer can unassign"
      ],
      "impact": "Organizations can now recall vouchers from recipients and recover funds, providing flexibility in voucher management and budget control",
      "affectedComponents": [
        "App.jsx - VCSEDashboard",
        "main.py - unassign_voucher endpoint"
      ],
      "userTypes": [
        "vcse",
        "school"
      ],
      "version": "1.0.3",
      "title_ar": "ميزة إلغاء تعيين القسيمة - إعادة الأموال إلى المحفظة",
      "description_ar": "تمت إضافة إمكانية لمستخدمي VCSE وSchool لإلغاء تعيين القسائم النشطة وإرجاع الأموال إلى محفظتهم الإلكترونية",
      "details_ar": [
        "تمت إضافة زر 'Unassign' (❌) بجانب زر 'Reassign' في Voucher Orders",
        "زر Unassign يظهر فقط للقسائم النشطة",
        "يظهر مربع حوار التأكيد تحذيرًا للمستخدم حول العواقب قبل إلغاء التعيين",
        "تم إنشاء نقطة نهاية Backend API /api/voucher/unassign",
        "يتم إعادة الأموال تلقائيًا إلى محفظة المنظمة عند إلغاء التعيين",
        "تم تغيير حالة Voucher إلى 'cancelled' مع تتبع السبب",
        "تم إنشاء معاملة المحفظة بنوع 'credit' لسجل التدقيق",
        "تتحقق فحوصات الأذونات من أن فقط مُصدر القسيمة يمكنه إلغاء التعيين"
      ],
      "impact_ar": "يمكن للمنظمات الآن استرجاع القسائم من المستلمين واسترداد الأموال، مما يوفر مرونة في إدارة القسائم والتحكم في الميزانية",
      "affectedComponents_ar": "App.jsx - VCSEDashboard، main.py - نقطة نهاية unassign_voucher",
      "title_pl": "Funkcja Odwiązania Vouchera - Zwrot Środków do Portfela",
      "description_pl": "Dodano możliwość dla użytkowników VCSE i szkół do odwiązywania aktywnych voucherów i zwracania środków do ich portfela",
      "impact_pl": "Organizacje mogą teraz cofać vouchery od odbiorców i odzyskiwać środki, co zapewnia elastyczność w zarządzaniu voucherami i kontrolę budżetu",
      "details_pl": [
        "Dodano przycisk 'Unassign' (❌) obok przycisku 'Reassign' w Voucher Orders",
        "Przycisk Unassign pojawia się tylko dla aktywnych voucherów",
        "Okno potwierdzenia ostrzega użytkownika o konsekwencjach przed odwiązaniem",
        "Utworzono backendowy endpoint API /api/voucher/unassign",
        "Środki są automatycznie zwracane do portfela organizacji po odwiązaniu",
        "Status vouchera zmieniany na 'cancelled' z rejestrowanym powodem",
        "Tworzona jest transakcja portfela typu 'credit' dla ścieżki audytu",
        "Sprawdzanie uprawnień zapewnia, że tylko wystawca vouchera może go odwiązać"
      ],
      "affectedComponents_pl": "App.jsx - VCSEDashboard, main.py - endpoint unassign_voucher",
      "title_ro": "Funcționalitate Voucher Unassign - Returnarea Fondurilor în Wallet",
      "description_ro": "Adăugată posibilitatea pentru utilizatorii VCSE și School de a dezaloca vouchere active și de a returna fondurile în wallet-ul lor",
      "impact_ro": "Organizațiile pot acum să recheme vouchere de la destinatari și să recupereze fondurile, oferind flexibilitate în gestionarea voucherelor și controlul bugetului",
      "details_ro": [
        "Adăugat butonul 'Unassign' (❌) lângă butonul 'Reassign' în Voucher Orders",
        "Butonul Unassign apare doar pentru voucherele active",
        "Dialogul de confirmare avertizează utilizatorul despre consecințe înainte de dezalocare",
        "Creat endpoint-ul Backend API /api/voucher/unassign",
        "Fondurile sunt returnate automat în wallet-ul organizației la dezalocare",
        "Starea voucherului este schimbată în 'cancelled' cu motivul înregistrat",
        "Tranzacție în wallet creată cu tipul 'credit' pentru audit trail",
        "Verificările de permisiuni asigură că doar emitentul voucherului poate dezaloca"
      ],
      "affectedComponents_ro": "App.jsx - VCSEDashboard, main.py - endpoint unassign_voucher"
    },
    {
      "id": 22,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "Security",
      "priority": "High",
      "title": "Fund Loading Restricted to Admin Only",
      "description": "Removed direct fund loading capability from VCSE and School dashboards - only Admin can add funds to organization wallets",
      "details": [
        "Removed 'Load Funds' tab from VCSE mobile navigation",
        "Removed PaymentTab component rendering from VCSE and School dashboards",
        "Replaced payment form in School wallet with admin-only notice",
        "Added informational message explaining admin-only fund allocation",
        "Added instructions on how to request funds from administrator",
        "Organizations can still view wallet balance and transaction history",
        "Payment processing now centralized through admin for better financial control"
      ],
      "impact": "Improved financial security and control - all fund allocations now require admin approval, preventing unauthorized fund loading",
      "affectedComponents": [
        "App.jsx - VCSEDashboard",
        "App.jsx - SchoolDashboard"
      ],
      "userTypes": [
        "vcse",
        "school",
        "admin"
      ],
      "version": "1.0.3",
      "title_ar": "تحميل الأموال مقتصر على المسؤول فقط",
      "description_ar": "تم إزالة خاصية تحميل الأموال مباشرة من لوحات تحكم VCSE وSchool - فقط المسؤول (Admin) يمكنه إضافة الأموال إلى محافظ المؤسسات.",
      "details_ar": [
        "تمت إزالة تبويب 'Load Funds' من تنقل تطبيق VCSE المحمول",
        "تمت إزالة عرض مكون PaymentTab من لوحات تحكم VCSE و School",
        "تم استبدال نموذج الدفع في School wallet بإشعار خاص بالمشرف فقط",
        "تمت إضافة رسالة معلوماتية تشرح تخصيص الأموال المخصص للمسؤولين فقط",
        "تمت إضافة تعليمات حول كيفية طلب الأموال من administrator",
        "لا تزال المنظمات قادرة على عرض رصيد المحفظة وتاريخ المعاملات",
        "تم الآن مركزية معالجة الدفع من خلال admin لتحكم مالي أفضل"
      ],
      "impact_ar": "تحسين الأمان المالي والتحكم - الآن تتطلب جميع تخصيصات الأموال موافقة المسؤول، مما يمنع تحميل الأموال غير المصرح به",
      "affectedComponents_ar": "App.jsx - VCSEDashboard, App.jsx - SchoolDashboard",
      "title_pl": "Ładowanie środków ograniczone tylko do administratora",
      "description_pl": "Usunięto bezpośrednią możliwość ładowania środków z pulpitów VCSE i School - tylko administrator może dodawać środki do portfeli organizacji",
      "impact_pl": "Ulepszono bezpieczeństwo finansowe i kontrolę - wszystkie przydziały środków wymagają teraz zatwierdzenia przez administratora, co zapobiega nieautoryzowanemu ładowaniu środków",
      "details_pl": [
        "Usunięto zakładkę 'Load Funds' z nawigacji mobilnej VCSE",
        "Usunięto renderowanie komponentu PaymentTab z pulpitów VCSE i School",
        "Zamieniono formularz płatności w portfelu School na komunikat tylko dla administratora",
        "Dodano wiadomość informacyjną wyjaśniającą, że przydział środków jest tylko dla administratora",
        "Dodano instrukcje, jak poprosić administratora o środki",
        "Organizacje nadal mogą przeglądać saldo portfela i historię transakcji",
        "Przetwarzanie płatności jest teraz scentralizowane przez administratora dla lepszej kontroli finansowej"
      ],
      "affectedComponents_pl": "App.jsx - VCSEDashboard, App.jsx - SchoolDashboard",
      "title_ro": "Încărcarea fondurilor restricționată doar pentru Admin",
      "description_ro": "Eliminată capacitatea directă de încărcare a fondurilor din dashboard-urile VCSE și School - doar Admin poate adăuga fonduri în portofelele organizațiilor",
      "impact_ro": "Securitate financiară și control îmbunătățite - toate alocările de fonduri necesită acum aprobarea adminului, prevenind încărcarea neautorizată a fondurilor",
      "details_ro": [
        "Eliminată fila 'Load Funds' din navigarea mobilă VCSE",
        "Eliminată redarea componentului PaymentTab din dashboard-urile VCSE și School",
        "Înlocuit formularul de plată din portofelul School cu un mesaj pentru admini",
        "Adăugat mesaj informativ care explică alocarea fondurilor doar pentru admini",
        "Adăugate instrucțiuni despre cum să se solicite fonduri de la administrator",
        "Organizațiile pot în continuare să vizualizeze soldul portofelului și istoricul tranzacțiilor",
        "Procesarea plăților este acum centralizată prin admin pentru un control financiar mai bun"
      ],
      "affectedComponents_ro": "App.jsx - VCSEDashboard, App.jsx - SchoolDashboard"
    },
    {
      "id": 21,
      "date": "2026-01-12",
      "commit": "TBD",
      "category": "UI Enhancement",
      "priority": "Low",
      "title": "LoginPage Duplicate Links Removal",
      "description": "Removed duplicate 'Forgot Password' and 'Back to Home' links at bottom of LoginPage",
      "details": [
        "Removed duplicate 'Forgot Password?' link at bottom (kept button version above)",
        "Removed duplicate 'Back to Home' link at bottom (kept button version above)",
        "Kept only 'Sign Up' link at bottom for cleaner design",
        "Improved visual hierarchy and reduced clutter",
        "Maintained all functionality with button versions above sign-in form"
      ],
      "impact": "Cleaner, less cluttered login page with better user experience and no duplicate navigation options",
      "affectedComponents": [
        "App.jsx - LoginPage component"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.3",
      "title_ar": "إزالة الروابط المكررة في LoginPage",
      "description_ar": "تمت إزالة الروابط المكررة 'Forgot Password' و 'Back to Home' في أسفل صفحة LoginPage",
      "details_ar": [
        "تمت إزالة رابط 'Forgot Password?' المكرر في الأسفل (تم الاحتفاظ بإصدار الزر في الأعلى)",
        "تمت إزالة رابط 'Back to Home' المكرر في الأسفل (تم الاحتفاظ بنسخة الزر في الأعلى)",
        "تم الاحتفاظ برابط 'Sign Up' فقط في الأسفل لتصميم أنظف",
        "تحسين التسلسل الهرمي البصري وتقليل الفوضى",
        "تم الحفاظ على جميع الوظائف مع إصدارات الأزرار أعلى نموذج تسجيل الدخول"
      ],
      "impact_ar": "صفحة تسجيل دخول أنظف وأقل ازدحامًا مع تجربة مستخدم محسنة وبدون خيارات تنقل مكررة",
      "affectedComponents_ar": "App.jsx - مكون LoginPage",
      "title_pl": "Usunięcie zduplikowanych linków na LoginPage",
      "description_pl": "Usunięto zduplikowane linki 'Forgot Password' i 'Back to Home' na dole LoginPage",
      "impact_pl": "Czystsza, mniej zagracona strona logowania z lepszym doświadczeniem użytkownika i bez zduplikowanych opcji nawigacji",
      "details_pl": [
        "Usunięto zduplikowany link 'Forgot Password?' na dole (zachowano wersję przycisku powyżej)",
        "Usunięto zduplikowany link 'Back to Home' na dole (zachowano wersję przycisku powyżej)",
        "Zachowano tylko link 'Sign Up' na dole dla czystszego designu",
        "Poprawiona hierarchia wizualna i zmniejszone zagracenie",
        "Zachowano pełną funkcjonalność z wersjami przycisków powyżej formularza logowania"
      ],
      "affectedComponents_pl": "App.jsx - komponent LoginPage",
      "title_ro": "Eliminarea linkurilor duplicate din LoginPage",
      "description_ro": "Am eliminat linkurile duplicate 'Forgot Password' și 'Back to Home' din partea de jos a LoginPage",
      "impact_ro": "Pagină de login mai curată, mai puțin aglomerată, cu o experiență de utilizare îmbunătățită și fără opțiuni de navigare duplicate",
      "details_ro": [
        "Am eliminat linkul duplicat 'Forgot Password?' din partea de jos (am păstrat versiunea buton de deasupra)",
        "Am eliminat linkul duplicat 'Back to Home' din partea de jos (am păstrat versiunea buton de deasupra)",
        "Am păstrat doar linkul 'Sign Up' în partea de jos pentru un design mai curat",
        "Am îmbunătățit ierarhia vizuală și am redus aglomerația",
        "Am menținut toată funcționalitatea cu versiunile buton de deasupra formularului de autentificare"
      ],
      "affectedComponents_ro": "App.jsx - componenta LoginPage"
    },
    {
      "id": 1,
      "date": "2026-01-11",
      "commit": "93022cd",
      "category": "Bug Fix",
      "priority": "Critical",
      "title": "Notification System - Text Visibility, Badge Display, and API URLs",
      "description": "Fixed critical notification system issues preventing users from viewing notifications",
      "details": [
        "Fixed incorrect API URLs preventing notifications from loading (/notifications/* → /api/notifications/*)",
        "Changed notification message color from #333 to #000 (black) for better readability",
        "Changed subtitle/metadata color from #666 to #555 (darker gray)",
        "Enhanced notification badge: brighter red (#ff0000), white border, box shadow, increased size to 22px",
        "Added dynamic width for '9+' display on badge",
        "Fixed empty notification panel issue - notifications now load from database correctly"
      ],
      "impact": "All user types (Admin, VCSE, Recipient, School) can now properly view and manage notifications",
      "affectedComponents": [
        "NotificationSystem.jsx"
      ],
      "userTypes": [
        "admin",
        "vcse",
        "recipient",
        "school"
      ],
      "version": "1.0.2",
      "title_ar": "نظام الإشعارات - وضوح النص، عرض الشارة، وعناوين URL الخاصة بـ API",
      "description_ar": "تم إصلاح مشكلات حرجة في نظام الإشعارات كانت تمنع المستخدمين من عرض الإشعارات",
      "details_ar": [
        "تم إصلاح عناوين URL الخاصة بـ API الخاطئة التي كانت تمنع تحميل الإشعارات (/notifications/* → /api/notifications/*)",
        "تم تغيير لون رسالة الإشعار من #333 إلى #000 (أسود) لتحسين قابلية القراءة",
        "تم تغيير لون الترجمة الفرعية/البيانات الوصفية من #666 إلى #555 (رمادي أغمق)",
        "شعار الإشعارات المحسّن: أحمر أكثر سطوعًا (#ff0000)، إطار أبيض، ظل صندوق، زيادة الحجم إلى 22px",
        "تمت إضافة عرض ديناميكي لعرض '9+' على الشارة",
        "تم إصلاح مشكلة لوحة الإشعارات الفارغة - الآن يتم تحميل الإشعارات من قاعدة البيانات بشكل صحيح"
      ],
      "impact_ar": "يمكن الآن لجميع أنواع المستخدمين (Admin، VCSE، Recipient، School) عرض الإشعارات وإدارتها بشكل صحيح",
      "affectedComponents_ar": "NotificationSystem.jsx",
      "title_pl": "System powiadomień - widoczność tekstu, wyświetlanie odznaki i adresy URL API",
      "description_pl": "Naprawiono krytyczne problemy w systemie powiadomień uniemożliwiające użytkownikom przeglądanie powiadomień",
      "impact_pl": "Wszystkie typy użytkowników (Admin, VCSE, Recipient, School) mogą teraz prawidłowo przeglądać i zarządzać powiadomieniami",
      "details_pl": [
        "Naprawiono niepoprawne adresy URL API uniemożliwiające ładowanie powiadomień (/notifications/* → /api/notifications/*)",
        "Zmieniono kolor wiadomości powiadomienia z #333 na #000 (czarny) dla lepszej czytelności",
        "Zmieniono kolor podtytułu/metadanych z #666 na #555 (ciemniejszy szary)",
        "Ulepszono odznakę powiadomień: jaśniejsza czerwień (#ff0000), biały obrys, cień pudełka, zwiększony rozmiar do 22px",
        "Dodano dynamiczną szerokość dla wyświetlania '9+' na odznace",
        "Naprawiono problem pustego panelu powiadomień - powiadomienia teraz poprawnie ładują się z bazy danych"
      ],
      "affectedComponents_pl": "NotificationSystem.jsx",
      "title_ro": "Sistem de notificări - Vizibilitatea textului, afișarea badge-ului și URL-urile API",
      "description_ro": "Au fost remediate probleme critice ale sistemului de notificări care împiedicau utilizatorii să vadă notificările",
      "impact_ro": "Toate tipurile de utilizatori (Admin, VCSE, Recipient, School) pot acum să vizualizeze și să gestioneze corect notificările",
      "details_ro": [
        "Au fost corectate URL-urile API incorecte care împiedicau încărcarea notificărilor (/notifications/* → /api/notifications/*)",
        "S-a schimbat culoarea mesajului de notificare de la #333 la #000 (negru) pentru o lizibilitate mai bună",
        "S-a schimbat culoarea subtitlului/metadatelor de la #666 la #555 (gri mai închis)",
        "Badge-ul de notificare a fost îmbunătățit: roșu mai aprins (#ff0000), bordură albă, umbră la cutie, dimensiune mărită la 22px",
        "A fost adăugată lățime dinamică pentru afișarea '9+' pe badge",
        "A fost remediată problema panoului de notificări gol - notificările se încarcă acum corect din baza de date"
      ],
      "affectedComponents_ro": "NotificationSystem.jsx"
    },
    {
      "id": 2,
      "date": "2026-01-11",
      "commit": "1752495",
      "category": "Internationalization",
      "priority": "High",
      "title": "VCSE and School Dashboard Stat Cards Translation",
      "description": "Fixed hardcoded English text in VCSE and School dashboard overview stat cards",
      "details": [
        "Replaced 'Total Vouchers Issued' with translation key",
        "Replaced 'Total Value Distributed' with translation key",
        "Replaced 'Active Vouchers' with translation key",
        "Replaced 'Redeemed Vouchers' with translation key",
        "Added translations for all 4 languages: English, Arabic, Romanian, Polish"
      ],
      "impact": "VCSE and School dashboard stat cards now fully translate when language is changed",
      "affectedComponents": [
        "App.jsx",
        "translation files"
      ],
      "userTypes": [
        "vcse",
        "school"
      ],
      "version": "1.0.2",
      "title_ar": "ترجمة بطاقات الإحصائيات في VCSE و School Dashboard",
      "description_ar": "تم إصلاح النص الإنجليزي المكتوب بشكل ثابت في بطاقات إحصائيات نظرة عامة على لوحة تحكم VCSE و School",
      "details_ar": [
        "تم استبدال 'Total Vouchers Issued' بمفتاح الترجمة",
        "تم استبدال 'Total Value Distributed' بمفتاح الترجمة",
        "تم استبدال 'Active Vouchers' بمفتاح الترجمة",
        "تم استبدال 'Redeemed Vouchers' بمفتاح الترجمة",
        "تمت إضافة الترجمات لجميع اللغات الأربع: English، Arabic، Romanian، Polish"
      ],
      "impact_ar": "بطاقات إحصائيات لوحة تحكم VCSE والمدرسة الآن تُترجم بالكامل عند تغيير اللغة",
      "affectedComponents_ar": "App.jsx، ملفات الترجمة",
      "title_pl": "Tłumaczenie kart statystyk VCSE i School Dashboard",
      "description_pl": "Naprawiono na stałe zakodowany tekst w języku angielskim w kartach statystyk przeglądu VCSE i School dashboard",
      "impact_pl": "Karty statystyk VCSE i School dashboard są teraz w pełni tłumaczone po zmianie języka",
      "details_pl": [
        "Zamieniono 'Total Vouchers Issued' na klucz tłumaczenia",
        "Zamieniono 'Total Value Distributed' na klucz tłumaczenia",
        "Zamieniono 'Active Vouchers' na klucz tłumaczenia",
        "Zamieniono 'Redeemed Vouchers' na klucz tłumaczenia",
        "Dodano tłumaczenia dla wszystkich 4 języków: angielski, arabski, rumuński, polski"
      ],
      "affectedComponents_pl": "App.jsx, pliki tłumaczeń",
      "title_ro": "Traducerea cardurilor de statistici din VCSE și Dashboard-ul Școlii",
      "description_ro": "Textul în limba engleză hardcodat a fost corectat în cardurile de statistici din overview-ul VCSE și Dashboard-ul Școlii",
      "impact_ro": "Cardurile de statistici din Dashboard-ul VCSE și Școlii se traduc acum complet când limba este schimbată",
      "details_ro": [
        "Înlocuit 'Total Vouchers Issued' cu cheia de traducere",
        "Înlocuit 'Total Value Distributed' cu cheia de traducere",
        "Înlocuit 'Active Vouchers' cu cheia de traducere",
        "Înlocuit 'Redeemed Vouchers' cu cheia de traducere",
        "Adăugate traduceri pentru toate cele 4 limbi: English, Arabic, Romanian, Polish"
      ],
      "affectedComponents_ro": "App.jsx, fișiere de traducere"
    },
    {
      "id": 3,
      "date": "2026-01-11",
      "commit": "451fffe",
      "category": "Internationalization",
      "priority": "High",
      "title": "AdminDashboard Overview Stat Cards Translation",
      "description": "Fixed hardcoded English text in Admin dashboard overview stat cards",
      "details": [
        "Replaced 'Total Vouchers' with t('dashboard.totalVouchers')",
        "Replaced 'Active Value' with t('dashboard.activeValue')",
        "Replaced 'VCFSE Organizations' with t('dashboard.vcfseOrganizations')",
        "Replaced 'Local Shops' with t('dashboard.localShops')",
        "Ensured all stat card titles translate properly across all 4 languages"
      ],
      "impact": "Admin dashboard overview cards now fully support language switching",
      "affectedComponents": [
        "App.jsx"
      ],
      "userTypes": [
        "admin"
      ],
      "version": "1.0.2",
      "title_ar": "ترجمة بطاقات الإحصائيات في نظرة عامة على AdminDashboard",
      "description_ar": "تم إصلاح النص الإنجليزي المكتوب بشكل ثابت في بطاقات إحصائيات نظرة عامة لوحة تحكم Admin",
      "details_ar": [
        "تم استبدال 'Total Vouchers' بـ t('dashboard.totalVouchers')",
        "تم استبدال 'Active Value' بـ t('dashboard.activeValue')",
        "تم استبدال 'VCFSE Organizations' بـ t('dashboard.vcfseOrganizations')",
        "تم استبدال 'Local Shops' بـ t('dashboard.localShops')",
        "تم التأكد من ترجمة جميع عناوين بطاقات الإحصائيات بشكل صحيح عبر جميع اللغات الأربع"
      ],
      "impact_ar": "بطاقات نظرة عامة على لوحة تحكم Admin تدعم الآن التبديل الكامل بين اللغات",
      "affectedComponents_ar": "App.jsx",
      "title_pl": "Tłumaczenie kart statystyk w przeglądzie AdminDashboard",
      "description_pl": "Naprawiono na stałe zakodowany tekst w języku angielskim w kartach statystyk przeglądu panelu administratora",
      "impact_pl": "Karty przeglądu panelu administratora teraz w pełni obsługują przełączanie języków",
      "details_pl": [
        "Zamieniono 'Total Vouchers' na t('dashboard.totalVouchers')",
        "Zamieniono 'Active Value' na t('dashboard.activeValue')",
        "Zamieniono 'VCFSE Organizations' na t('dashboard.vcfseOrganizations')",
        "Zamieniono 'Local Shops' na t('dashboard.localShops')",
        "Zapewniono, że wszystkie tytuły kart statystyk są poprawnie tłumaczone we wszystkich 4 językach"
      ],
      "affectedComponents_pl": "App.jsx",
      "title_ro": "Traducere carduri statistici AdminDashboard Overview",
      "description_ro": "Textul în limba engleză hardcodat a fost corectat în cardurile statistice din Admin dashboard overview",
      "impact_ro": "Cardurile din Admin dashboard overview suportă acum complet schimbarea limbii",
      "details_ro": [
        "Înlocuit 'Total Vouchers' cu t('dashboard.totalVouchers')",
        "Înlocuit 'Active Value' cu t('dashboard.activeValue')",
        "Înlocuit 'VCFSE Organizations' cu t('dashboard.vcfseOrganizations')",
        "Înlocuit 'Local Shops' cu t('dashboard.localShops')",
        "S-a asigurat că toate titlurile cardurilor statistice se traduc corect în toate cele 4 limbi"
      ],
      "affectedComponents_ro": "App.jsx"
    },
    {
      "id": 4,
      "date": "2026-01-11",
      "commit": "4e5f9f9",
      "category": "Internationalization",
      "priority": "Medium",
      "title": "Dashboard Overview Stat Card Translations",
      "description": "Added missing translation keys for dashboard stat cards",
      "details": [
        "Added totalVouchers, activeValue, vcfseOrganizations, localShops keys",
        "Added totalVouchersIssued, activeVouchers, redeemedVouchers keys",
        "Translated to Polish, Arabic, and Romanian",
        "Ensured consistency across all language files"
      ],
      "impact": "Complete translation coverage for all dashboard stat cards",
      "affectedComponents": [
        "translation files"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "ترجمات بطاقة إحصائيات نظرة عامة على لوحة التحكم",
      "description_ar": "تمت إضافة مفاتيح الترجمة المفقودة لبطاقات إحصائيات لوحة التحكم",
      "details_ar": [
        "تمت إضافة مفاتيح totalVouchers و activeValue و vcfseOrganizations و localShops",
        "تمت إضافة مفاتيح totalVouchersIssued و activeVouchers و redeemedVouchers",
        "تمت الترجمة إلى Polish و Arabic و Romanian",
        "تم ضمان التناسق عبر جميع ملفات اللغة"
      ],
      "impact_ar": "تغطية ترجمة كاملة لجميع بطاقات إحصائيات dashboard",
      "affectedComponents_ar": "ملفات الترجمة",
      "title_pl": "Tłumaczenia kart statystyk w Dashboard Overview",
      "description_pl": "Dodano brakujące klucze tłumaczeń dla kart statystyk dashboardu",
      "impact_pl": "Kompletne pokrycie tłumaczeniami wszystkich kart statystyk dashboardu",
      "details_pl": [
        "Dodano klucze totalVouchers, activeValue, vcfseOrganizations, localShops",
        "Dodano klucze totalVouchersIssued, activeVouchers, redeemedVouchers",
        "Przetłumaczono na polski, arabski i rumuński",
        "Zapewniono spójność we wszystkich plikach językowych"
      ],
      "affectedComponents_pl": "pliki tłumaczeń",
      "title_ro": "Traduceri pentru cardurile de statistici din Dashboard Overview",
      "description_ro": "Au fost adăugate cheile de traducere lipsă pentru cardurile de statistici din dashboard",
      "impact_ro": "Acoperire completă a traducerii pentru toate cardurile de statistici din dashboard",
      "details_ro": [
        "Au fost adăugate cheile totalVouchers, activeValue, vcfseOrganizations, localShops",
        "Au fost adăugate cheile totalVouchersIssued, activeVouchers, redeemedVouchers",
        "Tradus în poloneză, arabă și română",
        "S-a asigurat consistența în toate fișierele de limbă"
      ],
      "affectedComponents_ro": "fișiere de traducere"
    },
    {
      "id": 5,
      "date": "2026-01-11",
      "commit": "7d3e9e3",
      "category": "Internationalization",
      "priority": "High",
      "title": "AdminDashboard Sidebar Navigation Translations",
      "description": "Comprehensive fix for AdminDashboard sidebar navigation translations",
      "details": [
        "Fixed 'Overview' → t('navigation.overview')",
        "Fixed 'Recipient Management' → t('navigation.recipientManagement')",
        "Fixed 'VCFSE Verification' → t('navigation.vcfseVerification')",
        "Fixed 'Analytics' → t('navigation.analytics')",
        "Fixed 'Global Search' → t('navigation.globalSearch')",
        "Fixed 'Transaction Search' → t('navigation.transactionSearch')",
        "Fixed 'Broadcast Messages' → t('navigation.broadcastMessages')",
        "Fixed 'Fund Allocation' → t('navigation.fundAllocation')",
        "Added all translations to Arabic, Romanian, and Polish"
      ],
      "impact": "Complete sidebar navigation now translates properly for Admin users",
      "affectedComponents": [
        "App.jsx",
        "translation files"
      ],
      "userTypes": [
        "admin"
      ],
      "version": "1.0.2",
      "title_ar": "ترجمات التنقل في الشريط الجانبي لـ AdminDashboard",
      "description_ar": "تصحيح شامل لترجمات تنقل الشريط الجانبي في AdminDashboard",
      "details_ar": [
        "تم إصلاح 'Overview' → t('navigation.overview')",
        "تم إصلاح 'Recipient Management' → t('navigation.recipientManagement')",
        "تم إصلاح 'VCFSE Verification' → t('navigation.vcfseVerification')",
        "تم إصلاح 'Analytics' → t('navigation.analytics')",
        "تم إصلاح 'Global Search' → t('navigation.globalSearch')",
        "تم إصلاح 'Transaction Search' → t('navigation.transactionSearch')",
        "تم إصلاح 'Broadcast Messages' → t('navigation.broadcastMessages')",
        "تم إصلاح 'Fund Allocation' → t('navigation.fundAllocation')",
        "تمت إضافة جميع الترجمات إلى Arabic و Romanian و Polish"
      ],
      "impact_ar": "تم الآن ترجمة التنقل في الشريط الجانبي بالكامل بشكل صحيح لمستخدمي Admin",
      "affectedComponents_ar": "App.jsx، ملفات الترجمة",
      "title_pl": "Tłumaczenia nawigacji paska bocznego AdminDashboard",
      "description_pl": "Kompleksowa poprawka tłumaczeń nawigacji paska bocznego AdminDashboard",
      "impact_pl": "Pełna nawigacja paska bocznego teraz poprawnie tłumaczona dla użytkowników Admin",
      "details_pl": [
        "Naprawiono 'Overview' → t('navigation.overview')",
        "Naprawiono 'Recipient Management' → t('navigation.recipientManagement')",
        "Naprawiono 'VCFSE Verification' → t('navigation.vcfseVerification')",
        "Naprawiono 'Analytics' → t('navigation.analytics')",
        "Naprawiono 'Global Search' → t('navigation.globalSearch')",
        "Naprawiono 'Transaction Search' → t('navigation.transactionSearch')",
        "Naprawiono 'Broadcast Messages' → t('navigation.broadcastMessages')",
        "Naprawiono 'Fund Allocation' → t('navigation.fundAllocation')",
        "Dodano wszystkie tłumaczenia na arabski, rumuński i polski"
      ],
      "affectedComponents_pl": "App.jsx, pliki tłumaczeń",
      "title_ro": "Traduceri pentru navigarea în bara laterală AdminDashboard",
      "description_ro": "Remediere completă pentru traducerile navigării în bara laterală AdminDashboard",
      "impact_ro": "Navigarea completă în bara laterală se traduce acum corect pentru utilizatorii Admin",
      "details_ro": [
        "Corectat 'Overview' → t('navigation.overview')",
        "Corectat 'Recipient Management' → t('navigation.recipientManagement')",
        "Corectat 'VCFSE Verification' → t('navigation.vcfseVerification')",
        "Corectat 'Analytics' → t('navigation.analytics')",
        "Corectat 'Global Search' → t('navigation.globalSearch')",
        "Corectat 'Transaction Search' → t('navigation.transactionSearch')",
        "Corectat 'Broadcast Messages' → t('navigation.broadcastMessages')",
        "Corectat 'Fund Allocation' → t('navigation.fundAllocation')",
        "Adăugate toate traducerile în arabă, română și poloneză"
      ],
      "affectedComponents_ro": "App.jsx, fișiere de traducere"
    },
    {
      "id": 6,
      "date": "2026-01-11",
      "commit": "6d04e4e",
      "category": "Internationalization",
      "priority": "High",
      "title": "AdminDashboard Recipient Management Translation",
      "description": "Fixed translation issues in Admin recipient management section",
      "details": [
        "Fixed 'Add New Recipient' button translation",
        "Fixed 'Search recipients...' placeholder translation",
        "Fixed 'Filter by Status' dropdown translation",
        "Fixed 'All Statuses' option translation",
        "Fixed table headers: Name, Email, Phone, Vouchers, Status, Actions",
        "Fixed 'Edit', 'Deactivate', 'Activate' button translations",
        "Added all missing translations to Polish, Arabic, and Romanian"
      ],
      "impact": "Complete recipient management interface now supports all 4 languages",
      "affectedComponents": [
        "App.jsx",
        "translation files"
      ],
      "userTypes": [
        "admin"
      ],
      "version": "1.0.2",
      "title_ar": "لوحة تحكم المشرف إدارة المستلمين الترجمة",
      "description_ar": "تم إصلاح مشكلات الترجمة في قسم إدارة المستلمين في Admin",
      "details_ar": [
        "تم إصلاح ترجمة زر 'Add New Recipient'",
        "تم إصلاح ترجمة العنصر النائب 'Search recipients...'",
        "تم إصلاح ترجمة قائمة 'Filter by Status' المنسدلة",
        "تم إصلاح ترجمة خيار 'All Statuses'",
        "رؤوس الجداول المثبتة: Name، Email، Phone، Vouchers، Status، Actions",
        "تم إصلاح ترجمات أزرار 'Edit' و 'Deactivate' و 'Activate'",
        "تمت إضافة جميع الترجمات المفقودة إلى Polish و Arabic و Romanian"
      ],
      "impact_ar": "واجهة إدارة المستلمين الكاملة تدعم الآن جميع اللغات الأربع",
      "affectedComponents_ar": "App.jsx، ملفات الترجمة",
      "title_pl": "AdminDashboard Zarządzanie odbiorcami Tłumaczenie",
      "description_pl": "Naprawiono problemy z tłumaczeniem w sekcji zarządzania odbiorcami Admin",
      "impact_pl": "Kompletny interfejs zarządzania odbiorcami obsługuje teraz wszystkie 4 języki",
      "details_pl": [
        "Naprawiono tłumaczenie przycisku 'Add New Recipient'",
        "Naprawiono tłumaczenie pola placeholder 'Search recipients...'",
        "Naprawiono tłumaczenie rozwijanego menu 'Filter by Status'",
        "Naprawiono tłumaczenie opcji 'All Statuses'",
        "Naprawiono nagłówki tabeli: Name, Email, Phone, Vouchers, Status, Actions",
        "Naprawiono tłumaczenia przycisków 'Edit', 'Deactivate', 'Activate'",
        "Dodano wszystkie brakujące tłumaczenia na język polski, arabski i rumuński"
      ],
      "affectedComponents_pl": "App.jsx, pliki tłumaczeń",
      "title_ro": "AdminDashboard Managementul Destinatarilor Traducere",
      "description_ro": "Probleme de traducere fixate în secțiunea de management a destinatarilor Admin",
      "impact_ro": "Interfața completă de management a destinatarilor suportă acum toate cele 4 limbi",
      "details_ro": [
        "Traducerea butonului 'Add New Recipient' fixată",
        "Traducerea placeholder-ului 'Search recipients...' fixată",
        "Traducerea dropdown-ului 'Filter by Status' fixată",
        "Traducerea opțiunii 'All Statuses' fixată",
        "Anteturile tabelului fixate: Name, Email, Phone, Vouchers, Status, Actions",
        "Traducerile butoanelor 'Edit', 'Deactivate', 'Activate' fixate",
        "Au fost adăugate toate traducerile lipsă pentru Polish, Arabic și Romanian"
      ],
      "affectedComponents_ro": "App.jsx, fișierele de traducere"
    },
    {
      "id": 7,
      "date": "2026-01-11",
      "commit": "25041e5",
      "category": "Internationalization",
      "priority": "Medium",
      "title": "VCFSE Portal Discounted Items Translation",
      "description": "Fixed translation issues in VCFSE discounted items section",
      "details": [
        "Fixed 'Discounted Items from Local Shops' title translation",
        "Fixed 'Search discounted items...' placeholder translation",
        "Fixed 'Filter by Category' dropdown translation",
        "Fixed 'All Categories' option translation",
        "Fixed 'No discounted items available' message translation",
        "Added translations to all 4 languages"
      ],
      "impact": "VCFSE discounted items section now fully translates",
      "affectedComponents": [
        "App.jsx",
        "translation files"
      ],
      "userTypes": [
        "vcse"
      ],
      "version": "1.0.2",
      "title_ar": "ترجمة عناصر الخصم في بوابة VCFSE",
      "description_ar": "تم إصلاح مشكلات الترجمة في قسم VCFSE discounted items",
      "details_ar": [
        "تم إصلاح ترجمة عنوان 'Discounted Items from Local Shops'",
        "تم إصلاح ترجمة العنصر النائب 'Search discounted items...'",
        "تم إصلاح ترجمة قائمة 'Filter by Category' المنسدلة",
        "تم إصلاح ترجمة خيار 'All Categories'",
        "تم إصلاح ترجمة رسالة 'No discounted items available'",
        "تمت إضافة الترجمات إلى جميع اللغات الأربع"
      ],
      "impact_ar": "قسم العناصر المخفضة في VCFSE يُترجم بالكامل الآن",
      "affectedComponents_ar": "App.jsx، ملفات الترجمة",
      "title_pl": "Tłumaczenie pozycji z rabatem w portalu VCFSE",
      "description_pl": "Naprawiono problemy z tłumaczeniem w sekcji pozycji z rabatem VCFSE",
      "impact_pl": "Sekcja pozycji z rabatem VCFSE jest teraz w pełni przetłumaczona",
      "details_pl": [
        "Naprawiono tłumaczenie tytułu 'Discounted Items from Local Shops'",
        "Naprawiono tłumaczenie pola placeholder 'Search discounted items...'",
        "Naprawiono tłumaczenie rozwijanego menu 'Filter by Category'",
        "Naprawiono tłumaczenie opcji 'All Categories'",
        "Naprawiono tłumaczenie komunikatu 'No discounted items available'",
        "Dodano tłumaczenia na wszystkie 4 języki"
      ],
      "affectedComponents_pl": "App.jsx, pliki tłumaczeń",
      "title_ro": "Traducerea articolelor cu discount din portalul VCFSE",
      "description_ro": "Probleme de traducere rezolvate în secțiunea articolelor cu discount VCFSE",
      "impact_ro": "Secțiunea articolelor cu discount VCFSE este acum complet tradusă",
      "details_ro": [
        "Traducerea titlului „Discounted Items from Local Shops” a fost corectată",
        "Traducerea placeholder-ului „Search discounted items...” a fost corectată",
        "Traducerea dropdown-ului „Filter by Category” a fost corectată",
        "Traducerea opțiunii „All Categories” a fost corectată",
        "Traducerea mesajului „No discounted items available” a fost corectată",
        "Au fost adăugate traduceri pentru toate cele 4 limbi"
      ],
      "affectedComponents_ro": "App.jsx, fișierele de traducere"
    },
    {
      "id": 8,
      "date": "2026-01-11",
      "commit": "c0f3d2c",
      "category": "Configuration",
      "priority": "Low",
      "title": "Footer Email Update",
      "description": "Updated footer contact email address",
      "details": [
        "Changed from prince@bakupcic.co.uk to admin@bakupcic.co.uk",
        "Updated across all dashboards and pages"
      ],
      "impact": "Users now see correct admin contact email in footer",
      "affectedComponents": [
        "App.jsx"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "تحديث البريد الإلكتروني في التذييل",
      "description_ar": "تم تحديث عنوان البريد الإلكتروني في تذييل الصفحة للتواصل",
      "details_ar": [
        "تم التغيير من prince@bakupcic.co.uk إلى admin@bakupcic.co.uk",
        "تم التحديث عبر جميع اللوحات والصفحات"
      ],
      "impact_ar": "يرى المستخدمون الآن عنوان البريد الإلكتروني الصحيح لمسؤول الإدارة في التذييل",
      "affectedComponents_ar": "App.jsx  \nتحديثات في ملف App.jsx تشمل تحسينات في الأداء وإصلاحات للأخطاء المتعلقة بإدارة الحالة. تم تعديل بعض المكونات لتحسين التوافق مع React 18.",
      "title_pl": "Aktualizacja adresu e-mail w stopce",
      "description_pl": "Zaktualizowano adres e-mail kontaktowy w stopce",
      "impact_pl": "Użytkownicy widzą teraz poprawny adres e-mail kontaktu do administratora w stopce",
      "details_pl": [
        "Zmieniono z prince@bakupcic.co.uk na admin@bakupcic.co.uk",
        "Zaktualizowano na wszystkich dashboardach i stronach"
      ],
      "affectedComponents_pl": "App.jsx",
      "title_ro": "Actualizare email footer",
      "description_ro": "Adresa de email de contact din footer a fost actualizată",
      "impact_ro": "Utilizatorii văd acum adresa corectă de email pentru contactul admin în footer",
      "details_ro": [
        "S-a schimbat de la prince@bakupcic.co.uk la admin@bakupcic.co.uk",
        "Actualizat pe toate dashboard-urile și paginile"
      ],
      "affectedComponents_ro": "App.jsx"
    },
    {
      "id": 9,
      "date": "2026-01-11",
      "commit": "c5922ef",
      "category": "Internationalization",
      "priority": "Medium",
      "title": "Search and Filter Elements Translation",
      "description": "Fixed remaining untranslated search and filter elements",
      "details": [
        "Fixed search placeholders across all dashboards",
        "Fixed filter dropdowns and options",
        "Fixed 'No results found' messages",
        "Added translations for all interactive search/filter elements"
      ],
      "impact": "All search and filter UI elements now translate properly",
      "affectedComponents": [
        "App.jsx",
        "translation files"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "ترجمة عناصر البحث والتصفية",
      "description_ar": "تم إصلاح العناصر المتبقية من search و filter التي لم تُترجم",
      "details_ar": [
        "تم إصلاح عناصر نائب البحث عبر جميع لوحات التحكم",
        "تم إصلاح قوائم التصفية المنسدلة والخيارات",
        "تم إصلاح رسائل \"No results found\"",
        "تمت إضافة الترجمات لجميع عناصر البحث/التصفية التفاعلية"
      ],
      "impact_ar": "جميع عناصر واجهة المستخدم الخاصة بالبحث والتصفية الآن تُترجم بشكل صحيح",
      "affectedComponents_ar": "App.jsx، ملفات الترجمة",
      "title_pl": "Tłumaczenie elementów wyszukiwania i filtrowania",
      "description_pl": "Naprawiono pozostałe nieprzetłumaczone elementy wyszukiwania i filtrowania",
      "impact_pl": "Wszystkie elementy UI wyszukiwania i filtrowania są teraz poprawnie tłumaczone",
      "details_pl": [
        "Naprawiono placeholdery wyszukiwania we wszystkich dashboardach",
        "Naprawiono dropdowny filtrów i opcje",
        "Naprawiono komunikaty „No results found”",
        "Dodano tłumaczenia dla wszystkich interaktywnych elementów wyszukiwania/filtrowania"
      ],
      "affectedComponents_pl": "App.jsx, pliki tłumaczeń",
      "title_ro": "Traducerea elementelor de căutare și filtrare",
      "description_ro": "S-au corectat elementele rămase ne-traduse de căutare și filtrare",
      "impact_ro": "Toate elementele UI de căutare și filtrare se traduc acum corect",
      "details_ro": [
        "S-au corectat placeholder-ele de căutare în toate dashboard-urile",
        "S-au corectat dropdown-urile și opțiunile de filtrare",
        "S-au corectat mesajele „No results found”",
        "Au fost adăugate traduceri pentru toate elementele interactive de căutare/filtrare"
      ],
      "affectedComponents_ro": "App.jsx, fișiere de traducere"
    },
    {
      "id": 10,
      "date": "2026-01-11",
      "commit": "9d834d7",
      "category": "Internationalization",
      "priority": "High",
      "title": "Missing Translations - Arabic, Romanian, Polish",
      "description": "Added missing translation keys to non-English language files",
      "details": [
        "Added 50+ missing translation keys to Arabic translation file",
        "Added 50+ missing translation keys to Romanian translation file",
        "Added 50+ missing translation keys to Polish translation file",
        "Ensured parity with English translation file"
      ],
      "impact": "Complete translation coverage across all 4 supported languages",
      "affectedComponents": [
        "translation files"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "الترجمات المفقودة - Arabic, Romanian, Polish",
      "description_ar": "تمت إضافة مفاتيح الترجمة المفقودة إلى ملفات اللغات غير الإنجليزية",
      "details_ar": [
        "تمت إضافة أكثر من 50 مفتاح ترجمة مفقود إلى ملف الترجمة العربي",
        "تمت إضافة أكثر من 50 مفتاح ترجمة مفقود إلى ملف الترجمة الروماني",
        "تمت إضافة أكثر من 50 مفتاح ترجمة مفقود إلى ملف الترجمة البولندية",
        "تم ضمان التوافق مع ملف الترجمة الإنجليزي"
      ],
      "impact_ar": "تغطية ترجمة كاملة عبر جميع اللغات الأربعة المدعومة",
      "affectedComponents_ar": "ملفات الترجمة",
      "title_pl": "Brakujące tłumaczenia - arabski, rumuński, polski",
      "description_pl": "Dodano brakujące klucze tłumaczeń do plików języków innych niż angielski",
      "impact_pl": "Pełne pokrycie tłumaczeń we wszystkich 4 obsługiwanych językach",
      "details_pl": [
        "Dodano ponad 50 brakujących kluczy tłumaczeń do pliku tłumaczenia arabskiego",
        "Dodano ponad 50 brakujących kluczy tłumaczeń do pliku tłumaczenia rumuńskiego",
        "Dodano ponad 50 brakujących kluczy tłumaczeń do pliku tłumaczenia polskiego",
        "Zapewniono zgodność z plikiem tłumaczenia angielskiego"
      ],
      "affectedComponents_pl": "pliki tłumaczeń",
      "title_ro": "Traduceri lipsă - Arabică, Română, Poloneză",
      "description_ro": "Chei de traducere lipsă adăugate în fișierele de limbă non-engleză",
      "impact_ro": "Acoperire completă a traducerii în toate cele 4 limbi suportate",
      "details_ro": [
        "Peste 50 de chei de traducere lipsă adăugate în fișierul de traducere Arabică",
        "Peste 50 de chei de traducere lipsă adăugate în fișierul de traducere Română",
        "Peste 50 de chei de traducere lipsă adăugate în fișierul de traducere Poloneză",
        "S-a asigurat paritatea cu fișierul de traducere English"
      ],
      "affectedComponents_ro": "fișiere de traducere"
    },
    {
      "id": 11,
      "date": "2026-01-11",
      "commit": "f273bf0",
      "category": "Internationalization",
      "priority": "High",
      "title": "Incomplete Translations Across All Dashboards",
      "description": "Fixed incomplete translations found across multiple dashboards",
      "details": [
        "Fixed RecipientDashboard translation gaps",
        "Fixed VendorDashboard translation gaps",
        "Fixed SchoolDashboard translation gaps",
        "Fixed common UI elements (buttons, labels, messages)",
        "Added missing keys to all language files"
      ],
      "impact": "Comprehensive translation coverage across entire application",
      "affectedComponents": [
        "App.jsx",
        "translation files"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "ترجمات غير مكتملة عبر جميع Dashboards",
      "description_ar": "تم إصلاح الترجمات غير المكتملة الموجودة عبر عدة لوحات تحكم",
      "details_ar": [
        "تم إصلاح فجوات الترجمة في RecipientDashboard",
        "تم إصلاح فجوات الترجمة في VendorDashboard",
        "تم إصلاح فجوات الترجمة في SchoolDashboard",
        "تم تثبيت عناصر واجهة المستخدم الشائعة (buttons, labels, messages)",
        "تمت إضافة المفاتيح المفقودة إلى جميع ملفات اللغة"
      ],
      "impact_ar": "تغطية ترجمة شاملة عبر كامل التطبيق",
      "affectedComponents_ar": "App.jsx، ملفات الترجمة",
      "title_pl": "Niekompletne tłumaczenia we wszystkich dashboardach",
      "description_pl": "Naprawiono niekompletne tłumaczenia znalezione w wielu dashboardach",
      "impact_pl": "Kompleksowe pokrycie tłumaczeń w całej aplikacji",
      "details_pl": [
        "Naprawiono luki w tłumaczeniach RecipientDashboard",
        "Naprawiono luki w tłumaczeniach VendorDashboard",
        "Naprawiono luki w tłumaczeniach SchoolDashboard",
        "Naprawiono wspólne elementy UI (przyciski, etykiety, komunikaty)",
        "Dodano brakujące klucze do wszystkich plików językowych"
      ],
      "affectedComponents_pl": "App.jsx, pliki tłumaczeń",
      "title_ro": "Traduceri incomplete pe toate dashboard-urile",
      "description_ro": "S-au remediat traducerile incomplete găsite pe mai multe dashboard-uri",
      "impact_ro": "Acoperire completă a traducerilor în întreaga aplicație",
      "details_ro": [
        "S-au remediat lacunele de traducere din RecipientDashboard",
        "S-au remediat lacunele de traducere din VendorDashboard",
        "S-au remediat lacunele de traducere din SchoolDashboard",
        "S-au corectat elementele comune de UI (butoane, etichete, mesaje)",
        "Chei lipsă adăugate în toate fișierele de limbă"
      ],
      "affectedComponents_ro": "App.jsx, fișiere de traducere"
    },
    {
      "id": 12,
      "date": "2026-01-11",
      "commit": "0a8e668",
      "category": "UI Enhancement",
      "priority": "High",
      "title": "Responsive Hamburger Menus for All Dashboards",
      "description": "Implemented mobile-responsive hamburger navigation menus",
      "details": [
        "Added hamburger menu to AdminDashboard",
        "Added hamburger menu to VCSEDashboard",
        "Added hamburger menu to RecipientDashboard",
        "Added hamburger menu to SchoolDashboard",
        "Added hamburger menu to VendorDashboard",
        "Menus collapse automatically on mobile devices",
        "Smooth animations and transitions",
        "Fully translated menu items"
      ],
      "impact": "All dashboards now mobile-friendly with responsive navigation",
      "affectedComponents": [
        "App.jsx"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "قوائم الهامبرغر المتجاوبة لجميع لوحات التحكم",
      "description_ar": "تم تنفيذ قوائم التنقل الهامبرغر المتجاوبة مع الأجهزة المحمولة",
      "details_ar": [
        "تمت إضافة قائمة الهامبرغر إلى AdminDashboard",
        "تمت إضافة قائمة الهامبرغر إلى VCSEDashboard",
        "تمت إضافة قائمة الهامبرغر إلى RecipientDashboard",
        "تمت إضافة قائمة الهمبرغر إلى SchoolDashboard",
        "تمت إضافة قائمة الهامبرغر إلى VendorDashboard",
        "تنهار القوائم تلقائيًا على الأجهزة المحمولة",
        "رسوم متحركة وانتقالات سلسة",
        "عناصر القائمة مترجمة بالكامل"
      ],
      "impact_ar": "جميع لوحات المعلومات أصبحت الآن متوافقة مع الأجهزة المحمولة مع تنقل متجاوب",
      "affectedComponents_ar": "App.jsx",
      "title_pl": "Responsywne menu hamburgerowe dla wszystkich dashboardów",
      "description_pl": "Wdrożono mobilne, responsywne menu nawigacyjne hamburger",
      "impact_pl": "Wszystkie dashboardy teraz przyjazne dla urządzeń mobilnych z responsywną nawigacją",
      "details_pl": [
        "Dodano menu hamburger do AdminDashboard",
        "Dodano menu hamburger do VCSEDashboard",
        "Dodano menu hamburger do RecipientDashboard",
        "Dodano menu hamburger do SchoolDashboard",
        "Dodano menu hamburger do VendorDashboard",
        "Menu automatycznie zwija się na urządzeniach mobilnych",
        "Płynne animacje i przejścia",
        "W pełni przetłumaczone elementy menu"
      ],
      "affectedComponents_pl": "App.jsx",
      "title_ro": "Meniuri Hamburger Responsive pentru Toate Dashboard-urile",
      "description_ro": "Am implementat meniuri de navigare hamburger responsive pentru mobil",
      "impact_ro": "Toate dashboard-urile sunt acum prietenoase cu mobilul, cu navigare responsive",
      "details_ro": [
        "Am adăugat meniul hamburger în AdminDashboard",
        "Am adăugat meniul hamburger în VCSEDashboard",
        "Am adăugat meniul hamburger în RecipientDashboard",
        "Am adăugat meniul hamburger în SchoolDashboard",
        "Am adăugat meniul hamburger în VendorDashboard",
        "Meniurile se restrâng automat pe dispozitivele mobile",
        "Animații și tranziții fluide",
        "Elemente de meniu complet traduse"
      ],
      "affectedComponents_ro": "App.jsx"
    },
    {
      "id": 13,
      "date": "2026-01-11",
      "commit": "728ea75",
      "category": "Bug Fix",
      "priority": "Medium",
      "title": "QR Scanner - Fallback Translations and Camera Detection",
      "description": "Fixed QR scanner translation issues and improved camera detection",
      "details": [
        "Added fallback translations for missing QR scanner keys",
        "Improved camera permission detection",
        "Enhanced error messages with translations",
        "Fixed camera initialization issues on mobile devices"
      ],
      "impact": "QR scanner now works reliably across all devices and languages",
      "affectedComponents": [
        "QRScanner component"
      ],
      "userTypes": [
        "vendor",
        "vcse"
      ],
      "version": "1.0.2",
      "title_ar": "ماسح QR - الترجمات الاحتياطية واكتشاف الكاميرا",
      "description_ar": "تم إصلاح مشكلات الترجمة في QR scanner وتحسين اكتشاف الكاميرا",
      "details_ar": [
        "تمت إضافة ترجمات بديلة لمفاتيح QR scanner المفقودة",
        "تحسين اكتشاف أذونات الكاميرا",
        "تحسين رسائل الخطأ مع الترجمات",
        "تم إصلاح مشكلات تهيئة الكاميرا على الأجهزة المحمولة"
      ],
      "impact_ar": "يعمل QR scanner الآن بشكل موثوق عبر جميع الأجهزة واللغات",
      "affectedComponents_ar": "مكون QRScanner",
      "title_pl": "Skaner QR - tłumaczenia zapasowe i wykrywanie kamery",
      "description_pl": "Naprawiono problemy z tłumaczeniem skanera QR oraz ulepszono wykrywanie kamery",
      "impact_pl": "Skaner QR działa teraz niezawodnie na wszystkich urządzeniach i we wszystkich językach",
      "details_pl": [
        "Dodano tłumaczenia zapasowe dla brakujących kluczy skanera QR",
        "Ulepszono wykrywanie uprawnień do kamery",
        "Wzbogacono komunikaty o błędach o tłumaczenia",
        "Naprawiono problemy z inicjalizacją kamery na urządzeniach mobilnych"
      ],
      "affectedComponents_pl": "Komponent QRScanner",
      "title_ro": "Scanner QR - Traduceri de rezervă și detectare cameră",
      "description_ro": "Probleme de traducere ale scannerului QR rezolvate și detectarea camerei îmbunătățită",
      "impact_ro": "Scannerul QR funcționează acum fiabil pe toate dispozitivele și limbile",
      "details_ro": [
        "Adăugate traduceri de rezervă pentru cheile lipsă ale scannerului QR",
        "Detectarea permisiunii camerei îmbunătățită",
        "Mesaje de eroare îmbunătățite cu traduceri",
        "Probleme de inițializare a camerei pe dispozitive mobile rezolvate"
      ],
      "affectedComponents_ro": "Componenta QRScanner"
    },
    {
      "id": 14,
      "date": "2026-01-11",
      "commit": "84c4990",
      "category": "UI Enhancement",
      "priority": "Low",
      "title": "RegisterPage UI Improvements",
      "description": "Improved RegisterPage layout and functionality",
      "details": [
        "Removed About section for cleaner design",
        "Replaced social buttons with Forgot Password link",
        "Added Back to Home button",
        "Added green background to LoginPage for consistency"
      ],
      "impact": "Cleaner, more focused registration experience",
      "affectedComponents": [
        "RegisterPage",
        "LoginPage"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "تحسينات واجهة مستخدم RegisterPage",
      "description_ar": "تحسين تخطيط ووظائف RegisterPage",
      "details_ar": [
        "تمت إزالة قسم About لتصميم أنظف",
        "تم استبدال أزرار التواصل الاجتماعي برابط Forgot Password",
        "تمت إضافة زر Back to Home",
        "تمت إضافة خلفية خضراء إلى LoginPage من أجل الاتساق"
      ],
      "impact_ar": "تجربة تسجيل أنظف وأكثر تركيزًا",
      "affectedComponents_ar": "RegisterPage، LoginPage",
      "title_pl": "Ulepszenia interfejsu RegisterPage",
      "description_pl": "Ulepszony układ i funkcjonalność RegisterPage",
      "impact_pl": "Czystsze, bardziej skoncentrowane doświadczenie rejestracji",
      "details_pl": [
        "Usunięto sekcję About dla bardziej przejrzystego designu",
        "Zamieniono przyciski społecznościowe na link Forgot Password",
        "Dodano przycisk Back to Home",
        "Dodano zielone tło do LoginPage dla spójności"
      ],
      "affectedComponents_pl": "RegisterPage, LoginPage",
      "title_ro": "Îmbunătățiri UI pentru RegisterPage",
      "description_ro": "Layout și funcționalitate îmbunătățite pentru RegisterPage",
      "impact_ro": "Experiență de înregistrare mai curată și mai concentrată",
      "details_ro": [
        "Secțiunea About eliminată pentru un design mai curat",
        "Butoanele sociale înlocuite cu link-ul Forgot Password",
        "Adăugat butonul Back to Home",
        "Fundal verde adăugat la LoginPage pentru consistență"
      ],
      "affectedComponents_ro": "RegisterPage, LoginPage"
    },
    {
      "id": 15,
      "date": "2026-01-11",
      "commit": "80d37cf",
      "category": "UI Enhancement",
      "priority": "Medium",
      "title": "VendorDashboard Hamburger Menu",
      "description": "Added mobile-responsive hamburger menu to VendorDashboard",
      "details": [
        "Implemented collapsible navigation menu",
        "Added smooth animations",
        "Included all vendor navigation tabs",
        "Fully translated menu items"
      ],
      "impact": "VendorDashboard now mobile-friendly",
      "affectedComponents": [
        "App.jsx"
      ],
      "userTypes": [
        "vendor"
      ],
      "version": "1.0.2",
      "title_ar": "قائمة Hamburger في VendorDashboard",
      "description_ar": "تمت إضافة قائمة هامرجر المتجاوبة مع الأجهزة المحمولة إلى VendorDashboard",
      "details_ar": [
        "تم تنفيذ قائمة تنقل قابلة للطي",
        "تمت إضافة رسوم متحركة سلسة",
        "تم تضمين جميع علامات تبويب التنقل الخاصة بالبائعين",
        "عناصر القائمة مترجمة بالكامل"
      ],
      "impact_ar": "أصبح VendorDashboard الآن متوافقًا مع الأجهزة المحمولة",
      "affectedComponents_ar": "App.jsx",
      "title_pl": "Menu hamburgerowe VendorDashboard",
      "description_pl": "Dodano mobilne, responsywne menu hamburgerowe do VendorDashboard",
      "impact_pl": "VendorDashboard teraz przyjazny dla urządzeń mobilnych",
      "details_pl": [
        "Zaimplementowano zwijane menu nawigacyjne",
        "Dodano płynne animacje",
        "Uwzględniono wszystkie zakładki nawigacyjne dostawcy",
        "W pełni przetłumaczone elementy menu"
      ],
      "affectedComponents_pl": "App.jsx",
      "title_ro": "Meniul Hamburger din VendorDashboard",
      "description_ro": "Meniu hamburger responsive pentru mobil adăugat în VendorDashboard",
      "impact_ro": "VendorDashboard este acum prietenos cu dispozitivele mobile",
      "details_ro": [
        "Meniu de navigare pliabil implementat",
        "Animații fluide adăugate",
        "Incluse toate taburile de navigare pentru vendor",
        "Elemente de meniu complet traduse"
      ],
      "affectedComponents_ro": "App.jsx"
    },
    {
      "id": 16,
      "date": "2026-01-11",
      "commit": "16ccd87",
      "category": "UI Enhancement",
      "priority": "Medium",
      "title": "LoginPage Redesign",
      "description": "Redesigned LoginPage with modern, attractive styling",
      "details": [
        "Added gradient background",
        "Improved form layout and spacing",
        "Added social login options (Google, Facebook)",
        "Enhanced button styling",
        "Improved mobile responsiveness"
      ],
      "impact": "More professional and user-friendly login experience",
      "affectedComponents": [
        "LoginPage"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "إعادة تصميم LoginPage",
      "description_ar": "إعادة تصميم LoginPage بأسلوب حديث وجذاب",
      "details_ar": [
        "تمت إضافة خلفية تدرج لوني",
        "تحسين تخطيط النموذج والتباعد",
        "تمت إضافة خيارات تسجيل الدخول الاجتماعي (Google, Facebook)",
        "تحسين تنسيق الأزرار",
        "تحسين استجابة الهواتف المحمولة"
      ],
      "impact_ar": "تجربة تسجيل دخول أكثر احترافية وسهولة للمستخدم",
      "affectedComponents_ar": "صفحة تسجيل الدخول LoginPage",
      "title_pl": "Przeprojektowanie LoginPage",
      "description_pl": "Przeprojektowany LoginPage z nowoczesnym, atrakcyjnym stylem",
      "impact_pl": "Bardziej profesjonalne i przyjazne dla użytkownika doświadczenie logowania",
      "details_pl": [
        "Dodano gradientowe tło",
        "Ulepszono układ formularza i odstępy",
        "Dodano opcje logowania społecznościowego (Google, Facebook)",
        "Ulepszono stylizację przycisków",
        "Poprawiono responsywność na urządzeniach mobilnych"
      ],
      "affectedComponents_pl": "LoginPage",
      "title_ro": "Redesign LoginPage",
      "description_ro": "LoginPage redesenat cu un stil modern și atractiv",
      "impact_ro": "Experiență de autentificare mai profesională și prietenoasă cu utilizatorul",
      "details_ro": [
        "Fundal cu gradient adăugat",
        "Aspect și spațiere îmbunătățite ale formularului",
        "Opțiuni de autentificare socială adăugate (Google, Facebook)",
        "Stilizare îmbunătățită a butoanelor",
        "Responsivitate mobilă îmbunătățită"
      ],
      "affectedComponents_ro": "LoginPage"
    },
    {
      "id": 17,
      "date": "2026-01-11",
      "commit": "0b49b20",
      "category": "UI Enhancement",
      "priority": "Low",
      "title": "LoginPage About Section Removal",
      "description": "Removed About section from LoginPage for minimal design",
      "details": [
        "Removed unnecessary About section",
        "Streamlined login page layout",
        "Focused user attention on login form"
      ],
      "impact": "Cleaner, more focused login page",
      "affectedComponents": [
        "LoginPage"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "إزالة قسم About في LoginPage",
      "description_ar": "تمت إزالة قسم About من LoginPage لتصميم بسيط minimal design",
      "details_ar": [
        "تمت إزالة قسم About غير الضروري",
        "تبسيط تخطيط صفحة تسجيل الدخول",
        "تركيز انتباه المستخدم على نموذج تسجيل الدخول"
      ],
      "impact_ar": "صفحة تسجيل دخول أنظف وأكثر تركيزًا",
      "affectedComponents_ar": "صفحة تسجيل الدخول LoginPage",
      "title_pl": "Usunięcie sekcji About z LoginPage",
      "description_pl": "Usunięto sekcję About z LoginPage dla minimalistycznego designu",
      "impact_pl": "Czystsza, bardziej skoncentrowana strona logowania",
      "details_pl": [
        "Usunięto niepotrzebną sekcję About",
        "Uproszczony układ strony logowania",
        "Skoncentrowano uwagę użytkownika na formularzu logowania"
      ],
      "affectedComponents_pl": "LoginPage",
      "title_ro": "Eliminarea secțiunii About din LoginPage",
      "description_ro": "Secțiunea About a fost eliminată din LoginPage pentru un design minimalist",
      "impact_ro": "Pagină de login mai curată și mai concentrată",
      "details_ro": [
        "Secțiunea About inutilă a fost eliminată",
        "Aspectul paginii de login a fost simplificat",
        "Atenția utilizatorului a fost concentrată pe formularul de login"
      ],
      "affectedComponents_ro": "LoginPage"
    },
    {
      "id": 18,
      "date": "2026-01-11",
      "commit": "5426a42",
      "category": "UI Enhancement",
      "priority": "Low",
      "title": "LandingPage Font Size Hierarchy",
      "description": "Fixed font size hierarchy on LandingPage",
      "details": [
        "H1: 40px (main headings)",
        "H2: 32px (section headings)",
        "H3: 24px (subsection headings)",
        "P: 16px (body text)",
        "Footer: 13px (footer text)",
        "Proper visual hierarchy established"
      ],
      "impact": "Better readability and visual hierarchy on landing page",
      "affectedComponents": [
        "LandingPage"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "تسلسل حجم الخط في LandingPage",
      "description_ar": "تم إصلاح تسلسل حجم الخط في LandingPage",
      "details_ar": [
        "H1: 40px (العناوين الرئيسية)",
        "H2: 32px (عناوين الأقسام)",
        "H3: 24px (عناوين الفروع الفرعية)",
        "P: 16px (نص الجسم)",
        "تذييل الصفحة: 13px (نص التذييل)",
        "تم إنشاء التسلسل الهرمي البصري بشكل صحيح"
      ],
      "impact_ar": "تحسين قابلية القراءة والتسلسل البصري على صفحة الهبوط",
      "affectedComponents_ar": "LandingPage  \nصفحة الهبوط",
      "title_pl": "Hierarchia rozmiarów czcionek na LandingPage",
      "description_pl": "Naprawiona hierarchia rozmiarów czcionek na LandingPage",
      "impact_pl": "Lepsza czytelność i hierarchia wizualna na landing page",
      "details_pl": [
        "H1: 40px (główne nagłówki)",
        "H2: 32px (nagłówki sekcji)",
        "H3: 24px (nagłówki podsekcji)",
        "P: 16px (tekst główny)",
        "Footer: 13px (tekst stopki)",
        "Ustanowiona właściwa hierarchia wizualna"
      ],
      "affectedComponents_pl": "LandingPage",
      "title_ro": "Ierarhia dimensiunii fontului pe LandingPage",
      "description_ro": "Ierarhia dimensiunii fontului fixată pe LandingPage",
      "impact_ro": "Mai bună lizibilitate și ierarhie vizuală pe landing page",
      "details_ro": [
        "H1: 40px (titluri principale)",
        "H2: 32px (titluri de secțiune)",
        "H3: 24px (titluri de subsecțiune)",
        "P: 16px (text corp)",
        "Footer: 13px (text footer)",
        "Ierarhie vizuală corectă stabilită"
      ],
      "affectedComponents_ro": "LandingPage"
    },
    {
      "id": 19,
      "date": "2026-01-11",
      "commit": "89c9f1d",
      "category": "Bug Fix",
      "priority": "High",
      "title": "Admin Auto-Recreation Bug Fix",
      "description": "Fixed bug causing admin account to be auto-recreated",
      "details": [
        "Removed automatic admin creation logic",
        "Fixed footer font size hierarchy",
        "Prevented duplicate admin accounts"
      ],
      "impact": "Admin accounts no longer auto-recreate on every deployment",
      "affectedComponents": [
        "Backend initialization"
      ],
      "userTypes": [
        "admin"
      ],
      "version": "1.0.2",
      "title_ar": "إصلاح خطأ إعادة الإنشاء التلقائي للمسؤول",
      "description_ar": "تم إصلاح خطأ كان يتسبب في إعادة إنشاء حساب المسؤول تلقائيًا",
      "details_ar": [
        "تمت إزالة منطق إنشاء المسؤول التلقائي",
        "تم إصلاح تسلسل حجم خط الـ footer",
        "تم منع إنشاء حسابات مشرف مكررة"
      ],
      "impact_ar": "لم تعد حسابات Admin تُعاد إنشاؤها تلقائيًا في كل عملية نشر",
      "affectedComponents_ar": "تهيئة الـ Backend",
      "title_pl": "Poprawka błędu automatycznego odtwarzania konta admina",
      "description_pl": "Naprawiono błąd powodujący automatyczne odtwarzanie konta admina",
      "impact_pl": "Konta admina nie są już automatycznie odtwarzane przy każdym wdrożeniu",
      "details_pl": [
        "Usunięto logikę automatycznego tworzenia konta admina",
        "Naprawiono hierarchię rozmiaru czcionki w stopce",
        "Zapobiegano duplikowaniu kont admina"
      ],
      "affectedComponents_pl": "Inicjalizacja backendu",
      "title_ro": "Corecție bug auto-recreare admin",
      "description_ro": "Bug fixat care cauza recrearea automată a contului de admin",
      "impact_ro": "Conturile de admin nu se mai recreează automat la fiecare deployment",
      "details_ro": [
        "Eliminată logica de creare automată a adminului",
        "Corectată ierarhia dimensiunii fontului din footer",
        "Prevenite conturi duplicate de admin"
      ],
      "affectedComponents_ro": "Inițializare backend"
    },
    {
      "id": 20,
      "date": "2026-01-11",
      "commit": "d74bb07",
      "category": "UI Enhancement",
      "priority": "Medium",
      "title": "Font Size Increase Across All Dashboards",
      "description": "Increased font sizes across entire application for better readability",
      "details": [
        "Increased body text from 14px to 16px",
        "Increased headings by 2-4px",
        "Increased button text for better visibility",
        "Improved readability on all screen sizes"
      ],
      "impact": "Better readability and accessibility across entire application",
      "affectedComponents": [
        "All dashboards and components"
      ],
      "userTypes": [
        "all"
      ],
      "version": "1.0.2",
      "title_ar": "زيادة حجم الخط عبر جميع لوحات التحكم",
      "description_ar": "زيادة أحجام الخطوط عبر التطبيق بأكمله لتحسين قابلية القراءة",
      "details_ar": [
        "تم زيادة حجم نص الجسم من 14px إلى 16px",
        "تم زيادة حجم العناوين بمقدار 2-4 بكسل",
        "زيادة حجم نص الزر لتحسين الرؤية",
        "تحسين قابلية القراءة على جميع أحجام الشاشات"
      ],
      "impact_ar": "تحسين قابلية القراءة وسهولة الوصول عبر التطبيق بأكمله",
      "affectedComponents_ar": "جميع dashboards والمكونات",
      "title_pl": "Zwiększenie rozmiaru czcionki we wszystkich dashboardach",
      "description_pl": "Zwiększono rozmiary czcionek w całej aplikacji dla lepszej czytelności",
      "impact_pl": "Lepsza czytelność i dostępność w całej aplikacji",
      "details_pl": [
        "Zwiększono rozmiar tekstu głównego z 14px do 16px",
        "Zwiększono rozmiar nagłówków o 2-4px",
        "Zwiększono rozmiar tekstu przycisków dla lepszej widoczności",
        "Poprawiona czytelność na wszystkich rozmiarach ekranów"
      ],
      "affectedComponents_pl": "Wszystkie dashboardy i komponenty",
      "title_ro": "Creșterea dimensiunii fontului pe toate dashboard-urile",
      "description_ro": "Dimensiuni de font mărite în întreaga aplicație pentru o mai bună lizibilitate",
      "impact_ro": "Lizibilitate și accesibilitate îmbunătățite în întreaga aplicație",
      "details_ro": [
        "Textul corpului mărit de la 14px la 16px",
        "Titlurile mărite cu 2-4px",
        "Textul butoanelor mărit pentru o vizibilitate mai bună",
        "Lizibilitate îmbunătățită pe toate dimensiunile de ecran"
      ],
      "affectedComponents_ro": "Toate dashboard-urile și componentele"
    }
  ],
  "summary": {
    "totalChanges": 40,
    "categories": {
      "Bug Fix": 11,
      "Feature": 4,
      "Internationalization": 11,
      "UI Enhancement": 10,
      "Configuration": 1,
      "Security": 1,
      "Deployment": 1
    },
    "priorities": {
      "Critical": 5,
      "High": 19,
      "Medium": 14,
      "Low": 5
    },
    "affectedUserTypes": {
      "all": 15,
      "admin": 7,
      "vcse": 6,
      "recipient": 2,
      "school": 5,
      "vendor": 2
    }
  },
  "totalChanges": 44
}